adcode_list = [ 100000, 1, 2, 3, 4, 130000, 140000, 150000, 210000, 220000, 230000, 320000, 330000,
               340000, 350000, 360000, 370000, 410000, 420000, 430000, 440000, 450000, 460000,
               510000, 520000, 530000, 610000, 620000, 630000, 640000,110000, 310000,
               500000, 120000, 650100, 610100, 510100, 440300, 210100, 530100, 130900, 330100,
               510600, 520100, 320100, 640100, 620100, 350100, 810000, 610100, 630100, 410700, 370800,
               130600, 411300, 130100, 430100, 420100, 140200, 371300, 370200, 440100,
               511300, 370700, 370100, 131000, 130200, 410300, 321300, 130300, 440500, 210200, 370900,
               460100, 331000, 130500, 150100, 330600, 510700, 330300, 370600, 610400, 230100, 130400,
               440400, 450200, 442000, 220100, 360100, 450300, 350200, 441800, 440800, 320300, 350600,
               360700, 440600, 330400, 370300, 430400, 320200, 371400, 450100, 321000, 330200, 340100,
               441900, 130700, 440900, 341100, 440200, 140100, 440700, 460200, 330800, 150600, 320400,
               340200, 441300, 350500, 320500, 321100, 320700, 330500, 320900, 441200, 320800, 330700,
               320600, 321200]
area_list = ["全国", "成渝", "京津冀", "长三角", "珠三角", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省",
             "江西省",
             "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "四川省", "贵州省", "云南省", "陕西省",
             "甘肃省", "青海省", "宁夏回族自治区","北京市", "上海市", "重庆市", "天津市", "乌鲁木齐", "西安市",
             "成都市", "深圳市",  "沈阳市", "昆明市", "沧州市", "杭州市", "德阳市", "贵阳市", "南京市", "银川市", "兰州市",
             "福州市", "香港", "郑州市", "西宁市", "新乡市", "济宁市", "保定市", "南阳市", "石家庄市", "长沙市", "武汉市", "大同市",
             "临沂市", "青岛市", "广州市", "南充市", "潍坊市", "济南市", "廊坊", "唐山市", "洛阳市", "宿迁市", "秦皇岛市", "汕头市",
             "大连市", "泰安市", "海口市", "台州市", "邢台市", "呼和浩特市", "绍兴市", "绵阳市", "温州市", "烟台市", "咸阳市", "哈尔滨市",
             "邯郸市", "珠海市", "柳州市", "中山市", "长春市", "南昌市", "桂林市", "厦门市", "清远市", "湛江市", "徐州市", "漳州市",
             "赣州市", "佛山市", "嘉兴市", "淄博市", "衡阳市", "无锡市", "德州市", "南宁市", "扬州市", "宁波市", "合肥市", "东莞市",
             "张家口市", "茂名市", "滁州市", "韶关市", "太原市", "江门市", "三亚市", "衢州市", "鄂尔多斯", "常州市", "芜湖市", "惠州市",
             "泉州市", "苏州市", "镇江市", "连云港市", "湖州市", "盐城市", "肇庆市", "淮安市", "金华市", "南通市", "泰州市",
             ]


# 654000
# "伊犁",
# 650000,
# "新疆维吾尔自治区",
def build_date_range():
    star = '2020-12-9'
    end = '2021-1-9'

    data_time_range = []
    day = star.split('-')[2]
    mon = star.split('-')[1]
    year = star.split('-')[0]
    day = int(day)
    mon = int(mon)
    year = int(year)
    while star != end:
        data_time_range.append(star)
        day += 1
        big_mon = [1, 3, 5, 7, 8, 10]
        small_mon = [4, 6, 9, 11]
        spical = 2
        if mon in big_mon and day == 32:
            day = 1
            mon += 1
        elif mon in small_mon and day == 31:
            day = 1
            mon += 1
        elif mon == spical and day == 30:
            day = 1
            mon += 1
        elif mon == 12 and day == 32:
            year = 2021
            mon = 1
            day = 1
        star = '{}-{}-{}'.format(year, mon, day)
    data_time_range.append(end)
    return data_time_range


def build_dict():
    area_dict = {}
    for _ in range(len(adcode_list)):
        area_dict[adcode_list[_]] = area_list[_]
    return area_dict


data_time_range = build_date_range()
area_dict = build_dict()
