job = [
    {
        "value": "19000000000000",
        "parent": '',
        "label": "销售/商务拓展",
        "children": [
            {
                "value": "19000200000000",
                "parent": "19000000000000",
                "label": "销售顾问",
                "children": [
                    {
                        "value": "19000200150000",
                        "parent": "19000200000000",
                        "label": "汽车销售",
                        "children": []
                    },
                    {
                        "value": "19000200160000",
                        "parent": "19000200000000",
                        "label": "健康顾问",
                        "children": []
                    },
                    {
                        "value": "19000200170000",
                        "parent": "19000200000000",
                        "label": "招生",
                        "children": []
                    },
                    {
                        "value": "19000200010000",
                        "parent": "19000200000000",
                        "label": "促销导购",
                        "children": []
                    },
                    {
                        "value": "19000200020000",
                        "parent": "19000200000000",
                        "label": "大客户代表",
                        "children": []
                    },
                    {
                        "value": "19000200030000",
                        "parent": "19000200000000",
                        "label": "电话销售",
                        "children": []
                    },
                    {
                        "value": "19000200040000",
                        "parent": "19000200000000",
                        "label": "房产销售",
                        "children": []
                    },
                    {
                        "value": "19000200050000",
                        "parent": "19000200000000",
                        "label": "客户代表",
                        "children": []
                    },
                    {
                        "value": "19000200060000",
                        "parent": "19000200000000",
                        "label": "商品销售",
                        "children": []
                    },
                    {
                        "value": "19000200070000",
                        "parent": "19000200000000",
                        "label": "外贸销售",
                        "children": []
                    },
                    {
                        "value": "19000200080000",
                        "parent": "19000200000000",
                        "label": "网络销售",
                        "children": []
                    },
                    {
                        "value": "19000200090000",
                        "parent": "19000200000000",
                        "label": "销售工程师",
                        "children": []
                    },
                    {
                        "value": "19000200100000",
                        "parent": "19000200000000",
                        "label": "销售顾问",
                        "children": []
                    },
                    {
                        "value": "19000200130000",
                        "parent": "19000200000000",
                        "label": "销售经理",
                        "children": []
                    },
                    {
                        "value": "19000200140000",
                        "parent": "19000200000000",
                        "label": "销售专员",
                        "children": []
                    },
                    {
                        "value": "19000200110000",
                        "parent": "19000200000000",
                        "label": "医疗器械销售",
                        "children": []
                    },
                    {
                        "value": "19000200120000",
                        "parent": "19000200000000",
                        "label": "医药销售",
                        "children": []
                    },
                    {
                        "value": "12000100110000",
                        "parent": "19000200000000",
                        "label": "保险业务",
                        "children": []
                    }
                ]
            },
            {
                "value": "19000100000000",
                "parent": "19000000000000",
                "label": "商务拓展",
                "children": [
                    {
                        "value": "19000100010000",
                        "parent": "19000100000000",
                        "label": "BD商务拓展",
                        "children": []
                    },
                    {
                        "value": "19000100020000",
                        "parent": "19000100000000",
                        "label": "供应商/新店开发",
                        "children": []
                    },
                    {
                        "value": "19000100030000",
                        "parent": "19000100000000",
                        "label": "广告业务拓展",
                        "children": []
                    },
                    {
                        "value": "19000100040000",
                        "parent": "19000100000000",
                        "label": "渠道销售",
                        "children": []
                    },
                    {
                        "value": "19000100050000",
                        "parent": "19000100000000",
                        "label": "营销推广",
                        "children": []
                    },
                    {
                        "value": "19000100060000",
                        "parent": "19000100000000",
                        "label": "招商",
                        "children": []
                    }
                ]
            },
            {
                "value": "19000300000000",
                "parent": "19000000000000",
                "label": "销售管理",
                "children": [
                    {
                        "value": "19000300010000",
                        "parent": "19000300000000",
                        "label": "城市经理",
                        "children": []
                    },
                    {
                        "value": "19000300020000",
                        "parent": "19000300000000",
                        "label": "销售督导",
                        "children": []
                    },
                    {
                        "value": "19000300030000",
                        "parent": "19000300000000",
                        "label": "销售管理",
                        "children": []
                    },
                    {
                        "value": "19000300040000",
                        "parent": "19000300000000",
                        "label": "销售总监",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "14000000000000",
        "parent": '',
        "label": "人事/行政/财务/法务",
        "children": [
            {
                "value": "14000700000000",
                "parent": "14000000000000",
                "label": "文员/助理",
                "children": [
                    {
                        "value": "14000700010000",
                        "parent": "14000700000000",
                        "label": "IT技术文员/助理",
                        "children": []
                    },
                    {
                        "value": "14000700020000",
                        "parent": "14000700000000",
                        "label": "产品助理",
                        "children": []
                    },
                    {
                        "value": "14000700030000",
                        "parent": "14000700000000",
                        "label": "单证员",
                        "children": []
                    },
                    {
                        "value": "14000700040000",
                        "parent": "14000700000000",
                        "label": "电脑操作/打字/录入员",
                        "children": []
                    },
                    {
                        "value": "14000700050000",
                        "parent": "14000700000000",
                        "label": "订单处理员",
                        "children": []
                    },
                    {
                        "value": "14000700060000",
                        "parent": "14000700000000",
                        "label": "秘书/文员",
                        "children": []
                    },
                    {
                        "value": "14000700070000",
                        "parent": "14000700000000",
                        "label": "培训助理/助教",
                        "children": []
                    },
                    {
                        "value": "14000700080000",
                        "parent": "14000700000000",
                        "label": "前台/总机/接待",
                        "children": []
                    },
                    {
                        "value": "14000700090000",
                        "parent": "14000700000000",
                        "label": "设计师助理",
                        "children": []
                    },
                    {
                        "value": "14000700100000",
                        "parent": "14000700000000",
                        "label": "生产文员",
                        "children": []
                    },
                    {
                        "value": "14000700110000",
                        "parent": "14000700000000",
                        "label": "统计员",
                        "children": []
                    },
                    {
                        "value": "14000700120000",
                        "parent": "14000700000000",
                        "label": "投资助理",
                        "children": []
                    },
                    {
                        "value": "14000700130000",
                        "parent": "14000700000000",
                        "label": "项目计划合约专员",
                        "children": []
                    },
                    {
                        "value": "14000700140000",
                        "parent": "14000700000000",
                        "label": "销售助理",
                        "children": []
                    },
                    {
                        "value": "14000700150000",
                        "parent": "14000700000000",
                        "label": "信息披露专员",
                        "children": []
                    },
                    {
                        "value": "14000700160000",
                        "parent": "14000700000000",
                        "label": "证券事务代表",
                        "children": []
                    },
                    {
                        "value": "14000700170000",
                        "parent": "14000700000000",
                        "label": "助教",
                        "children": []
                    },
                    {
                        "value": "14000700180000",
                        "parent": "14000700000000",
                        "label": "助理",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000600000000",
                "parent": "14000000000000",
                "label": "人事",
                "children": [
                    {
                        "value": "14000600010000",
                        "parent": "14000600000000",
                        "label": "HRBP",
                        "children": []
                    },
                    {
                        "value": "14000600020000",
                        "parent": "14000600000000",
                        "label": "工会",
                        "children": []
                    },
                    {
                        "value": "14000600030000",
                        "parent": "14000600000000",
                        "label": "绩效考核经理",
                        "children": []
                    },
                    {
                        "value": "14000600040000",
                        "parent": "14000600000000",
                        "label": "绩效考核专员",
                        "children": []
                    },
                    {
                        "value": "14000600050000",
                        "parent": "14000600000000",
                        "label": "培训经理/主管",
                        "children": []
                    },
                    {
                        "value": "14000600060000",
                        "parent": "14000600000000",
                        "label": "培训专员/助理",
                        "children": []
                    },
                    {
                        "value": "14000600070000",
                        "parent": "14000600000000",
                        "label": "企业文化",
                        "children": []
                    },
                    {
                        "value": "14000600080000",
                        "parent": "14000600000000",
                        "label": "人力资源顾问",
                        "children": []
                    },
                    {
                        "value": "14000600090000",
                        "parent": "14000600000000",
                        "label": "人力资源经理/主管",
                        "children": []
                    },
                    {
                        "value": "14000600100000",
                        "parent": "14000600000000",
                        "label": "人力资源专员",
                        "children": []
                    },
                    {
                        "value": "14000600110000",
                        "parent": "14000600000000",
                        "label": "人力资源总监",
                        "children": []
                    },
                    {
                        "value": "14000600120000",
                        "parent": "14000600000000",
                        "label": "人事信息系统(HRIS)管理",
                        "children": []
                    },
                    {
                        "value": "14000600130000",
                        "parent": "14000600000000",
                        "label": "社保专员",
                        "children": []
                    },
                    {
                        "value": "14000600140000",
                        "parent": "14000600000000",
                        "label": "薪酬福利",
                        "children": []
                    },
                    {
                        "value": "14000600150000",
                        "parent": "14000600000000",
                        "label": "员工关系",
                        "children": []
                    },
                    {
                        "value": "14000600160000",
                        "parent": "14000600000000",
                        "label": "招聘",
                        "children": []
                    },
                    {
                        "value": "14000600170000",
                        "parent": "14000600000000",
                        "label": "组织发展",
                        "children": []
                    },
                    {
                        "value": "14000600180000",
                        "parent": "14000600000000",
                        "label": "人事测评",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000400000000",
                "parent": "14000000000000",
                "label": "行政",
                "children": [
                    {
                        "value": "14000400010000",
                        "parent": "14000400000000",
                        "label": "党工团干事",
                        "children": []
                    },
                    {
                        "value": "14000400020000",
                        "parent": "14000400000000",
                        "label": "行政主管/办公室主任",
                        "children": []
                    },
                    {
                        "value": "14000400030000",
                        "parent": "14000400000000",
                        "label": "行政专员",
                        "children": []
                    },
                    {
                        "value": "14000400040000",
                        "parent": "14000400000000",
                        "label": "行政总监",
                        "children": []
                    },
                    {
                        "value": "14000400050000",
                        "parent": "14000400000000",
                        "label": "内勤/后勤",
                        "children": []
                    },
                    {
                        "value": "14000400060000",
                        "parent": "14000400000000",
                        "label": "销售行政主管",
                        "children": []
                    },
                    {
                        "value": "14000400070000",
                        "parent": "14000400000000",
                        "label": "销售行政专员",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000100000000",
                "parent": "14000000000000",
                "label": "财务",
                "children": [
                    {
                        "value": "14000100010000",
                        "parent": "14000100000000",
                        "label": "财务分析",
                        "children": []
                    },
                    {
                        "value": "14000100020000",
                        "parent": "14000100000000",
                        "label": "财务顾问",
                        "children": []
                    },
                    {
                        "value": "14000100030000",
                        "parent": "14000100000000",
                        "label": "财务经理",
                        "children": []
                    },
                    {
                        "value": "14000100040000",
                        "parent": "14000100000000",
                        "label": "财务主管",
                        "children": []
                    },
                    {
                        "value": "14000100050000",
                        "parent": "14000100000000",
                        "label": "财务助理",
                        "children": []
                    },
                    {
                        "value": "14000100060000",
                        "parent": "14000100000000",
                        "label": "财务总监",
                        "children": []
                    },
                    {
                        "value": "14000100070000",
                        "parent": "14000100000000",
                        "label": "成本管理",
                        "children": []
                    },
                    {
                        "value": "14000100080000",
                        "parent": "14000100000000",
                        "label": "成本会计",
                        "children": []
                    },
                    {
                        "value": "14000100090000",
                        "parent": "14000100000000",
                        "label": "成本经理/主管",
                        "children": []
                    },
                    {
                        "value": "14000100100000",
                        "parent": "14000100000000",
                        "label": "出纳",
                        "children": []
                    },
                    {
                        "value": "14000100110000",
                        "parent": "14000100000000",
                        "label": "房地产资产管理",
                        "children": []
                    },
                    {
                        "value": "14000100120000",
                        "parent": "14000100000000",
                        "label": "固定资产会计",
                        "children": []
                    },
                    {
                        "value": "14000100130000",
                        "parent": "14000100000000",
                        "label": "核销员",
                        "children": []
                    },
                    {
                        "value": "14000100140000",
                        "parent": "14000100000000",
                        "label": "会计经理",
                        "children": []
                    },
                    {
                        "value": "14000100150000",
                        "parent": "14000100000000",
                        "label": "会计助理",
                        "children": []
                    },
                    {
                        "value": "14000100160000",
                        "parent": "14000100000000",
                        "label": "审计",
                        "children": []
                    },
                    {
                        "value": "14000100170000",
                        "parent": "14000100000000",
                        "label": "税务",
                        "children": []
                    },
                    {
                        "value": "14000100180000",
                        "parent": "14000100000000",
                        "label": "注册会计师",
                        "children": []
                    },
                    {
                        "value": "14000100190000",
                        "parent": "14000100000000",
                        "label": "资产/资金管理",
                        "children": []
                    },
                    {
                        "value": "14000100200000",
                        "parent": "14000100000000",
                        "label": "资金专员",
                        "children": []
                    },
                    {
                        "value": "14000100210000",
                        "parent": "14000100000000",
                        "label": "总账会计",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000500000000",
                "parent": "14000000000000",
                "label": "合规风控/法务/律师",
                "children": [
                    {
                        "value": "14000500010000",
                        "parent": "14000500000000",
                        "label": "法律顾问",
                        "children": []
                    },
                    {
                        "value": "14000500020000",
                        "parent": "14000500000000",
                        "label": "风控",
                        "children": []
                    },
                    {
                        "value": "14000500030000",
                        "parent": "14000500000000",
                        "label": "公司法务",
                        "children": []
                    },
                    {
                        "value": "14000500040000",
                        "parent": "14000500000000",
                        "label": "合规稽查",
                        "children": []
                    },
                    {
                        "value": "14000500050000",
                        "parent": "14000500000000",
                        "label": "律师助理",
                        "children": []
                    },
                    {
                        "value": "14000500060000",
                        "parent": "14000500000000",
                        "label": "民事律师",
                        "children": []
                    },
                    {
                        "value": "14000500070000",
                        "parent": "14000500000000",
                        "label": "企业律师/合规顾问",
                        "children": []
                    },
                    {
                        "value": "14000500080000",
                        "parent": "14000500000000",
                        "label": "事务所律师",
                        "children": []
                    },
                    {
                        "value": "14000500090000",
                        "parent": "14000500000000",
                        "label": "诉讼律师",
                        "children": []
                    },
                    {
                        "value": "14000500100000",
                        "parent": "14000500000000",
                        "label": "知识产权律师",
                        "children": []
                    },
                    {
                        "value": "14000500110000",
                        "parent": "14000500000000",
                        "label": "专利律师",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000200000000",
                "parent": "14000000000000",
                "label": "档案管理",
                "children": [
                    {
                        "value": "14000200010000",
                        "parent": "14000200000000",
                        "label": "档案管理",
                        "children": []
                    },
                    {
                        "value": "14000200020000",
                        "parent": "14000200000000",
                        "label": "合同管理",
                        "children": []
                    },
                    {
                        "value": "14000200030000",
                        "parent": "14000200000000",
                        "label": "图书管理",
                        "children": []
                    },
                    {
                        "value": "14000200040000",
                        "parent": "14000200000000",
                        "label": "资料管理",
                        "children": []
                    }
                ]
            },
            {
                "value": "14000300000000",
                "parent": "14000000000000",
                "label": "关务",
                "children": [
                    {
                        "value": "14000300010000",
                        "parent": "14000300000000",
                        "label": "报关员",
                        "children": []
                    },
                    {
                        "value": "14000300020000",
                        "parent": "14000300000000",
                        "label": "关务管理",
                        "children": []
                    },
                    {
                        "value": "14000300030000",
                        "parent": "14000300000000",
                        "label": "关务专员",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "9000000000000",
        "parent": '',
        "label": "互联网/通信及硬件",
        "children": [
            {
                "value": "9000300000000",
                "parent": "9000000000000",
                "label": "软件研发",
                "children": [
                    {
                        "value": "9000300010000",
                        "parent": "9000300000000",
                        "label": ".NET",
                        "children": []
                    },
                    {
                        "value": "9000300020000",
                        "parent": "9000300000000",
                        "label": "C",
                        "children": []
                    },
                    {
                        "value": "9000300030000",
                        "parent": "9000300000000",
                        "label": "C#",
                        "children": []
                    },
                    {
                        "value": "9000300040000",
                        "parent": "9000300000000",
                        "label": "C++",
                        "children": []
                    },
                    {
                        "value": "9000300050000",
                        "parent": "9000300000000",
                        "label": "Delphi",
                        "children": []
                    },
                    {
                        "value": "9000300060000",
                        "parent": "9000300000000",
                        "label": "Erlang",
                        "children": []
                    },
                    {
                        "value": "9000300070000",
                        "parent": "9000300000000",
                        "label": "ERP技术/应用",
                        "children": []
                    },
                    {
                        "value": "9000300080000",
                        "parent": "9000300000000",
                        "label": "GIS",
                        "children": []
                    },
                    {
                        "value": "9000300090000",
                        "parent": "9000300000000",
                        "label": "Golang",
                        "children": []
                    },
                    {
                        "value": "9000300100000",
                        "parent": "9000300000000",
                        "label": "IT技术/研发总监",
                        "children": []
                    },
                    {
                        "value": "9000300110000",
                        "parent": "9000300000000",
                        "label": "Java",
                        "children": []
                    },
                    {
                        "value": "9000300120000",
                        "parent": "9000300000000",
                        "label": "mano",
                        "children": []
                    },
                    {
                        "value": "9000300130000",
                        "parent": "9000300000000",
                        "label": "Node.js",
                        "children": []
                    },
                    {
                        "value": "9000300140000",
                        "parent": "9000300000000",
                        "label": "Perl",
                        "children": []
                    },
                    {
                        "value": "9000300150000",
                        "parent": "9000300000000",
                        "label": "PHP",
                        "children": []
                    },
                    {
                        "value": "9000300160000",
                        "parent": "9000300000000",
                        "label": "Python",
                        "children": []
                    },
                    {
                        "value": "9000300170000",
                        "parent": "9000300000000",
                        "label": "Ruby",
                        "children": []
                    },
                    {
                        "value": "9000300180000",
                        "parent": "9000300000000",
                        "label": "VB",
                        "children": []
                    },
                    {
                        "value": "9000300190000",
                        "parent": "9000300000000",
                        "label": "架构师",
                        "children": []
                    },
                    {
                        "value": "9000300200000",
                        "parent": "9000300000000",
                        "label": "脚本开发",
                        "children": []
                    },
                    {
                        "value": "9000300210000",
                        "parent": "9000300000000",
                        "label": "配置管理",
                        "children": []
                    },
                    {
                        "value": "9000300220000",
                        "parent": "9000300000000",
                        "label": "嵌入式软件开发",
                        "children": []
                    },
                    {
                        "value": "9000300230000",
                        "parent": "9000300000000",
                        "label": "软件工程师",
                        "children": []
                    },
                    {
                        "value": "9000300240000",
                        "parent": "9000300000000",
                        "label": "系统集成",
                        "children": []
                    },
                    {
                        "value": "9000300250000",
                        "parent": "9000300000000",
                        "label": "需求分析",
                        "children": []
                    },
                    {
                        "value": "9000300260000",
                        "parent": "9000300000000",
                        "label": "研发经理",
                        "children": []
                    },
                    {
                        "value": "9000300270000",
                        "parent": "9000300000000",
                        "label": "语音/视频/图形开发",
                        "children": []
                    },
                    {
                        "value": "9000300280000",
                        "parent": "9000300000000",
                        "label": "云计算",
                        "children": []
                    }
                ]
            },
            {
                "value": "9000500000000",
                "parent": "9000000000000",
                "label": "通信及硬件研发",
                "children": [
                    {
                        "value": "9000500010000",
                        "parent": "9000500000000",
                        "label": "5G",
                        "children": []
                    },
                    {
                        "value": "9000500020000",
                        "parent": "9000500000000",
                        "label": "ARM开发",
                        "children": []
                    },
                    {
                        "value": "9000500030000",
                        "parent": "9000500000000",
                        "label": "BIM工程师",
                        "children": []
                    },
                    {
                        "value": "9000500040000",
                        "parent": "9000500000000",
                        "label": "DSP开发",
                        "children": []
                    },
                    {
                        "value": "9000500050000",
                        "parent": "9000500000000",
                        "label": "FPGA开发",
                        "children": []
                    },
                    {
                        "value": "9000500060000",
                        "parent": "9000500000000",
                        "label": "IC验证工程师",
                        "children": []
                    },
                    {
                        "value": "9000500070000",
                        "parent": "9000500000000",
                        "label": "PCB工艺",
                        "children": []
                    },
                    {
                        "value": "9000500080000",
                        "parent": "9000500000000",
                        "label": "PLC工程师",
                        "children": []
                    },
                    {
                        "value": "9000500090000",
                        "parent": "9000500000000",
                        "label": "安防系统工程师",
                        "children": []
                    },
                    {
                        "value": "9000500100000",
                        "parent": "9000500000000",
                        "label": "版图设计工程师",
                        "children": []
                    },
                    {
                        "value": "9000500110000",
                        "parent": "9000500000000",
                        "label": "半导体技术",
                        "children": []
                    },
                    {
                        "value": "9000500120000",
                        "parent": "9000500000000",
                        "label": "单片机",
                        "children": []
                    },
                    {
                        "value": "9000500130000",
                        "parent": "9000500000000",
                        "label": "电控工程师",
                        "children": []
                    },
                    {
                        "value": "9000500140000",
                        "parent": "9000500000000",
                        "label": "电路工程师/技术员",
                        "children": []
                    },
                    {
                        "value": "9000500150000",
                        "parent": "9000500000000",
                        "label": "电气工程师",
                        "children": []
                    },
                    {
                        "value": "9000500160000",
                        "parent": "9000500000000",
                        "label": "电气线路设计",
                        "children": []
                    },
                    {
                        "value": "9000500170000",
                        "parent": "9000500000000",
                        "label": "电信交换工程师",
                        "children": []
                    },
                    {
                        "value": "9000500180000",
                        "parent": "9000500000000",
                        "label": "电信网络工程师",
                        "children": []
                    },
                    {
                        "value": "9000500190000",
                        "parent": "9000500000000",
                        "label": "电子/电器工艺/制程工程师",
                        "children": []
                    },
                    {
                        "value": "9000500200000",
                        "parent": "9000500000000",
                        "label": "电子工程设计",
                        "children": []
                    },
                    {
                        "value": "9000500210000",
                        "parent": "9000500000000",
                        "label": "电子技术研发工程师",
                        "children": []
                    },
                    {
                        "value": "9000500220000",
                        "parent": "9000500000000",
                        "label": "电子元器件工程师",
                        "children": []
                    },
                    {
                        "value": "9000500230000",
                        "parent": "9000500000000",
                        "label": "仿真应用工程师",
                        "children": []
                    },
                    {
                        "value": "9000500240000",
                        "parent": "9000500000000",
                        "label": "高级硬件工程师",
                        "children": []
                    },
                    {
                        "value": "9000500250000",
                        "parent": "9000500000000",
                        "label": "光传输工程师",
                        "children": []
                    },
                    {
                        "value": "9000500260000",
                        "parent": "9000500000000",
                        "label": "光伏系统工程师",
                        "children": []
                    },
                    {
                        "value": "9000500270000",
                        "parent": "9000500000000",
                        "label": "光通信工程师",
                        "children": []
                    },
                    {
                        "value": "9000500280000",
                        "parent": "9000500000000",
                        "label": "光网络工程师",
                        "children": []
                    },
                    {
                        "value": "9000500290000",
                        "parent": "9000500000000",
                        "label": "核心网工程师",
                        "children": []
                    },
                    {
                        "value": "9000500300000",
                        "parent": "9000500000000",
                        "label": "互连工程师",
                        "children": []
                    },
                    {
                        "value": "9000500310000",
                        "parent": "9000500000000",
                        "label": "激光/光电子技术",
                        "children": []
                    },
                    {
                        "value": "9000500320000",
                        "parent": "9000500000000",
                        "label": "集成电路IC设计/应用工程师",
                        "children": []
                    },
                    {
                        "value": "9000500330000",
                        "parent": "9000500000000",
                        "label": "精益工程师",
                        "children": []
                    },
                    {
                        "value": "9000500340000",
                        "parent": "9000500000000",
                        "label": "模拟电路设计/应用工程师",
                        "children": []
                    },
                    {
                        "value": "9000500350000",
                        "parent": "9000500000000",
                        "label": "嵌入式硬件",
                        "children": []
                    },
                    {
                        "value": "9000500360000",
                        "parent": "9000500000000",
                        "label": "射频工程师",
                        "children": []
                    },
                    {
                        "value": "9000500370000",
                        "parent": "9000500000000",
                        "label": "射频通信工程师",
                        "children": []
                    },
                    {
                        "value": "9000500380000",
                        "parent": "9000500000000",
                        "label": "室分设计工程师",
                        "children": []
                    },
                    {
                        "value": "9000500390000",
                        "parent": "9000500000000",
                        "label": "通信标准化工程师",
                        "children": []
                    },
                    {
                        "value": "9000500400000",
                        "parent": "9000500000000",
                        "label": "通信电源工程师",
                        "children": []
                    },
                    {
                        "value": "9000500410000",
                        "parent": "9000500000000",
                        "label": "通信工程师",
                        "children": []
                    },
                    {
                        "value": "9000500420000",
                        "parent": "9000500000000",
                        "label": "无线电工程师",
                        "children": []
                    },
                    {
                        "value": "9000500490000",
                        "parent": "9000500000000",
                        "label": "物联网",
                        "children": []
                    },
                    {
                        "value": "9000500430000",
                        "parent": "9000500000000",
                        "label": "线路结构设计",
                        "children": []
                    },
                    {
                        "value": "9000500440000",
                        "parent": "9000500000000",
                        "label": "移动通信工程师",
                        "children": []
                    },
                    {
                        "value": "9000500450000",
                        "parent": "9000500000000",
                        "label": "音频/视频工程师",
                        "children": []
                    },
                    {
                        "value": "9000500460000",
                        "parent": "9000500000000",
                        "label": "硬件工程师",
                        "children": []
                    },
                    {
                        "value": "9000500470000",
                        "parent": "9000500000000",
                        "label": "硬件交互设计师",
                        "children": []
                    },
                    {
                        "value": "9000500480000",
                        "parent": "9000500000000",
                        "label": "有线传输工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "9000100000000",
                "parent": "9000000000000",
                "label": "前端开发",
                "children": [
                    {
                        "value": "9000100010000",
                        "parent": "9000100000000",
                        "label": "HTML5",
                        "children": []
                    },
                    {
                        "value": "9000100020000",
                        "parent": "9000100000000",
                        "label": "JavaScript",
                        "children": []
                    },
                    {
                        "value": "9000100030000",
                        "parent": "9000100000000",
                        "label": "web前端",
                        "children": []
                    },
                    {
                        "value": "9000100040000",
                        "parent": "9000100000000",
                        "label": "前端开发",
                        "children": []
                    }
                ]
            },
            {
                "value": "9000600000000",
                "parent": "9000000000000",
                "label": "移动研发",
                "children": [
                    {
                        "value": "9000600010000",
                        "parent": "9000600000000",
                        "label": "Android",
                        "children": []
                    },
                    {
                        "value": "9000600020000",
                        "parent": "9000600000000",
                        "label": "APP设计",
                        "children": []
                    },
                    {
                        "value": "9000600030000",
                        "parent": "9000600000000",
                        "label": "COCOS2DX",
                        "children": []
                    },
                    {
                        "value": "9000600040000",
                        "parent": "9000600000000",
                        "label": "iOS",
                        "children": []
                    },
                    {
                        "value": "9000600050000",
                        "parent": "9000600000000",
                        "label": "U3D",
                        "children": []
                    },
                    {
                        "value": "9000600060000",
                        "parent": "9000600000000",
                        "label": "WP",
                        "children": []
                    },
                    {
                        "value": "9000600070000",
                        "parent": "9000600000000",
                        "label": "微信",
                        "children": []
                    },
                    {
                        "value": "9000600080000",
                        "parent": "9000600000000",
                        "label": "小程序",
                        "children": []
                    },
                    {
                        "value": "9000600090000",
                        "parent": "9000600000000",
                        "label": "小游戏",
                        "children": []
                    },
                    {
                        "value": "9000600100000",
                        "parent": "9000600000000",
                        "label": "移动互联网",
                        "children": []
                    },
                    {
                        "value": "9000600110000",
                        "parent": "9000600000000",
                        "label": "移动开发",
                        "children": []
                    }
                ]
            },
            {
                "value": "9000200000000",
                "parent": "9000000000000",
                "label": "人工智能",
                "children": [
                    {
                        "value": "9000200010000",
                        "parent": "9000200000000",
                        "label": "机器视觉算法",
                        "children": []
                    },
                    {
                        "value": "9000200020000",
                        "parent": "9000200000000",
                        "label": "机器学习算法",
                        "children": []
                    },
                    {
                        "value": "9000200030000",
                        "parent": "9000200000000",
                        "label": "模式识别",
                        "children": []
                    },
                    {
                        "value": "9000200040000",
                        "parent": "9000200000000",
                        "label": "人工智能",
                        "children": []
                    },
                    {
                        "value": "9000200050000",
                        "parent": "9000200000000",
                        "label": "深度学习",
                        "children": []
                    },
                    {
                        "value": "9000200060000",
                        "parent": "9000200000000",
                        "label": "数据研究员",
                        "children": []
                    },
                    {
                        "value": "9000200070000",
                        "parent": "9000200000000",
                        "label": "算法工程师",
                        "children": []
                    },
                    {
                        "value": "9000200080000",
                        "parent": "9000200000000",
                        "label": "图像处理算法",
                        "children": []
                    },
                    {
                        "value": "9000200090000",
                        "parent": "9000200000000",
                        "label": "图像识别",
                        "children": []
                    },
                    {
                        "value": "9000200100000",
                        "parent": "9000200000000",
                        "label": "自然语言算法",
                        "children": []
                    }
                ]
            },
            {
                "value": "9000400000000",
                "parent": "9000000000000",
                "label": "数据工程师",
                "children": [
                    {
                        "value": "9000400010000",
                        "parent": "9000400000000",
                        "label": "BI",
                        "children": []
                    },
                    {
                        "value": "9000400020000",
                        "parent": "9000400000000",
                        "label": "ETL工程师",
                        "children": []
                    },
                    {
                        "value": "9000400030000",
                        "parent": "9000400000000",
                        "label": "Hadoop",
                        "children": []
                    },
                    {
                        "value": "9000400040000",
                        "parent": "9000400000000",
                        "label": "爬虫",
                        "children": []
                    },
                    {
                        "value": "9000400050000",
                        "parent": "9000400000000",
                        "label": "数据采集",
                        "children": []
                    },
                    {
                        "value": "9000400060000",
                        "parent": "9000400000000",
                        "label": "数据仓库",
                        "children": []
                    },
                    {
                        "value": "9000400070000",
                        "parent": "9000400000000",
                        "label": "数据分析师",
                        "children": []
                    },
                    {
                        "value": "9000400080000",
                        "parent": "9000400000000",
                        "label": "数据架构师",
                        "children": []
                    },
                    {
                        "value": "9000400090000",
                        "parent": "9000400000000",
                        "label": "数据开发",
                        "children": []
                    },
                    {
                        "value": "9000400100000",
                        "parent": "9000400000000",
                        "label": "数据挖掘",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "17000000000000",
        "parent": '',
        "label": "视觉/交互/设计",
        "children": [
            {
                "value": "17000500000000",
                "parent": "17000000000000",
                "label": "视觉/交互",
                "children": [
                    {
                        "value": "17000500010000",
                        "parent": "17000500000000",
                        "label": "3D设计师",
                        "children": []
                    },
                    {
                        "value": "17000500020000",
                        "parent": "17000500000000",
                        "label": "3D设计制作",
                        "children": []
                    },
                    {
                        "value": "17000500030000",
                        "parent": "17000500000000",
                        "label": "CAD设计/制图",
                        "children": []
                    },
                    {
                        "value": "17000500040000",
                        "parent": "17000500000000",
                        "label": "UE设计",
                        "children": []
                    },
                    {
                        "value": "17000500050000",
                        "parent": "17000500000000",
                        "label": "UI设计",
                        "children": []
                    },
                    {
                        "value": "17000500060000",
                        "parent": "17000500000000",
                        "label": "UX设计师",
                        "children": []
                    },
                    {
                        "value": "17000500070000",
                        "parent": "17000500000000",
                        "label": "插画师",
                        "children": []
                    },
                    {
                        "value": "17000500080000",
                        "parent": "17000500000000",
                        "label": "计算机辅助设计师",
                        "children": []
                    },
                    {
                        "value": "17000500090000",
                        "parent": "17000500000000",
                        "label": "交互设计",
                        "children": []
                    },
                    {
                        "value": "17000500100000",
                        "parent": "17000500000000",
                        "label": "美工",
                        "children": []
                    },
                    {
                        "value": "17000500110000",
                        "parent": "17000500000000",
                        "label": "美术设计师（2D/3D）",
                        "children": []
                    },
                    {
                        "value": "17000500120000",
                        "parent": "17000500000000",
                        "label": "平面设计",
                        "children": []
                    },
                    {
                        "value": "17000500190000",
                        "parent": "17000500000000",
                        "label": "设计管理人员",
                        "children": []
                    },
                    {
                        "value": "17000500130000",
                        "parent": "17000500000000",
                        "label": "网页设计制作",
                        "children": []
                    },
                    {
                        "value": "17000500140000",
                        "parent": "17000500000000",
                        "label": "游戏策划",
                        "children": []
                    },
                    {
                        "value": "17000500150000",
                        "parent": "17000500000000",
                        "label": "游戏界面场景",
                        "children": []
                    },
                    {
                        "value": "17000500160000",
                        "parent": "17000500000000",
                        "label": "游戏设计开发",
                        "children": []
                    },
                    {
                        "value": "17000500170000",
                        "parent": "17000500000000",
                        "label": "原画师",
                        "children": []
                    },
                    {
                        "value": "17000500180000",
                        "parent": "17000500000000",
                        "label": "主笔设计师",
                        "children": []
                    }
                ]
            },
            {
                "value": "17000400000000",
                "parent": "17000000000000",
                "label": "建筑/室内设计",
                "children": [
                    {
                        "value": "17000400010000",
                        "parent": "17000400000000",
                        "label": "城市规划设计",
                        "children": []
                    },
                    {
                        "value": "17000400020000",
                        "parent": "17000400000000",
                        "label": "环境艺术设计",
                        "children": []
                    },
                    {
                        "value": "17000400030000",
                        "parent": "17000400000000",
                        "label": "家居设计",
                        "children": []
                    },
                    {
                        "value": "17000400040000",
                        "parent": "17000400000000",
                        "label": "家装设计",
                        "children": []
                    },
                    {
                        "value": "17000400050000",
                        "parent": "17000400000000",
                        "label": "建筑工程师",
                        "children": []
                    },
                    {
                        "value": "17000400060000",
                        "parent": "17000400000000",
                        "label": "建筑模型师",
                        "children": []
                    },
                    {
                        "value": "17000400070000",
                        "parent": "17000400000000",
                        "label": "建筑制图",
                        "children": []
                    },
                    {
                        "value": "17000400080000",
                        "parent": "17000400000000",
                        "label": "景观规划设计",
                        "children": []
                    },
                    {
                        "value": "17000400090000",
                        "parent": "17000400000000",
                        "label": "幕墙设计",
                        "children": []
                    },
                    {
                        "value": "17000400100000",
                        "parent": "17000400000000",
                        "label": "软装设计",
                        "children": []
                    },
                    {
                        "value": "17000400110000",
                        "parent": "17000400000000",
                        "label": "施工图设计",
                        "children": []
                    },
                    {
                        "value": "17000400120000",
                        "parent": "17000400000000",
                        "label": "室内设计",
                        "children": []
                    },
                    {
                        "value": "17000400130000",
                        "parent": "17000400000000",
                        "label": "效果图设计",
                        "children": []
                    },
                    {
                        "value": "17000400140000",
                        "parent": "17000400000000",
                        "label": "硬装设计",
                        "children": []
                    },
                    {
                        "value": "17000400150000",
                        "parent": "17000400000000",
                        "label": "园林/景观设计",
                        "children": []
                    },
                    {
                        "value": "17000400160000",
                        "parent": "17000400000000",
                        "label": "照明设计",
                        "children": []
                    },
                    {
                        "value": "17000400170000",
                        "parent": "17000400000000",
                        "label": "智能化设计",
                        "children": []
                    },
                    {
                        "value": "17000400180000",
                        "parent": "17000400000000",
                        "label": "注册建筑师",
                        "children": []
                    }
                ]
            },
            {
                "value": "17000300000000",
                "parent": "17000000000000",
                "label": "工业设计",
                "children": [
                    {
                        "value": "17000300010000",
                        "parent": "17000300000000",
                        "label": "包装设计",
                        "children": []
                    },
                    {
                        "value": "17000300020000",
                        "parent": "17000300000000",
                        "label": "布艺设计",
                        "children": []
                    },
                    {
                        "value": "17000300030000",
                        "parent": "17000300000000",
                        "label": "橱柜设计",
                        "children": []
                    },
                    {
                        "value": "17000300040000",
                        "parent": "17000300000000",
                        "label": "服装/纺织品设计",
                        "children": []
                    },
                    {
                        "value": "17000300050000",
                        "parent": "17000300000000",
                        "label": "服装/纺织设计总监",
                        "children": []
                    },
                    {
                        "value": "17000300060000",
                        "parent": "17000300000000",
                        "label": "工业设计",
                        "children": []
                    },
                    {
                        "value": "17000300070000",
                        "parent": "17000300000000",
                        "label": "工艺品/珠宝设计",
                        "children": []
                    },
                    {
                        "value": "17000300080000",
                        "parent": "17000300000000",
                        "label": "家具设计",
                        "children": []
                    },
                    {
                        "value": "17000300090000",
                        "parent": "17000300000000",
                        "label": "玩具设计",
                        "children": []
                    },
                    {
                        "value": "17000300100000",
                        "parent": "17000300000000",
                        "label": "鞋子设计",
                        "children": []
                    },
                    {
                        "value": "17000300110000",
                        "parent": "17000300000000",
                        "label": "艺术/设计总监",
                        "children": []
                    }
                ]
            },
            {
                "value": "17000200000000",
                "parent": "17000000000000",
                "label": "动画动效设计",
                "children": [
                    {
                        "value": "17000200010000",
                        "parent": "17000200000000",
                        "label": "Flash设计/开发",
                        "children": []
                    },
                    {
                        "value": "17000200020000",
                        "parent": "17000200000000",
                        "label": "动画设计",
                        "children": []
                    },
                    {
                        "value": "17000200030000",
                        "parent": "17000200000000",
                        "label": "动漫手绘",
                        "children": []
                    },
                    {
                        "value": "17000200040000",
                        "parent": "17000200000000",
                        "label": "角色模型师",
                        "children": []
                    },
                    {
                        "value": "17000200050000",
                        "parent": "17000200000000",
                        "label": "特效设计",
                        "children": []
                    },
                    {
                        "value": "17000200060000",
                        "parent": "17000200000000",
                        "label": "游戏原画师",
                        "children": []
                    }
                ]
            },
            {
                "value": "17000600000000",
                "parent": "17000000000000",
                "label": "舞美设计",
                "children": [
                    {
                        "value": "17000600010000",
                        "parent": "17000600000000",
                        "label": "灯光师",
                        "children": []
                    },
                    {
                        "value": "17000600020000",
                        "parent": "17000600000000",
                        "label": "服装道具",
                        "children": []
                    },
                    {
                        "value": "17000600030000",
                        "parent": "17000600000000",
                        "label": "化妆师",
                        "children": []
                    },
                    {
                        "value": "17000600040000",
                        "parent": "17000600000000",
                        "label": "舞美设计",
                        "children": []
                    },
                    {
                        "value": "17000600050000",
                        "parent": "17000600000000",
                        "label": "舞台艺术指导",
                        "children": []
                    },
                    {
                        "value": "17000600060000",
                        "parent": "17000600000000",
                        "label": "造型师",
                        "children": []
                    }
                ]
            },
            {
                "value": "17000100000000",
                "parent": "17000000000000",
                "label": "陈列展示设计",
                "children": [
                    {
                        "value": "17000100010000",
                        "parent": "17000100000000",
                        "label": "陈列展示设计",
                        "children": []
                    },
                    {
                        "value": "17000100020000",
                        "parent": "17000100000000",
                        "label": "花艺师",
                        "children": []
                    },
                    {
                        "value": "17000100030000",
                        "parent": "17000100000000",
                        "label": "展览设计师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "12000000000000",
        "parent": '',
        "label": "金融/保险",
        "children": [
            {
                "value": "12000300000000",
                "parent": "12000000000000",
                "label": "银行及金融服务",
                "children": [
                    {
                        "value": "12000300010000",
                        "parent": "12000300000000",
                        "label": "保理人",
                        "children": []
                    },
                    {
                        "value": "12000300020000",
                        "parent": "12000300000000",
                        "label": "催收",
                        "children": []
                    },
                    {
                        "value": "12000300030000",
                        "parent": "12000300000000",
                        "label": "大堂经理",
                        "children": []
                    },
                    {
                        "value": "12000300040000",
                        "parent": "12000300000000",
                        "label": "大堂助理",
                        "children": []
                    },
                    {
                        "value": "12000300050000",
                        "parent": "12000300000000",
                        "label": "柜员",
                        "children": []
                    },
                    {
                        "value": "12000300060000",
                        "parent": "12000300000000",
                        "label": "客户经理",
                        "children": []
                    },
                    {
                        "value": "12000300070000",
                        "parent": "12000300000000",
                        "label": "理财顾问",
                        "children": []
                    },
                    {
                        "value": "12000300080000",
                        "parent": "12000300000000",
                        "label": "清算",
                        "children": []
                    },
                    {
                        "value": "12000300090000",
                        "parent": "12000300000000",
                        "label": "信贷管理",
                        "children": []
                    },
                    {
                        "value": "12000300100000",
                        "parent": "12000300000000",
                        "label": "银行公司业务",
                        "children": []
                    }
                ]
            },
            {
                "value": "12000200000000",
                "parent": "12000000000000",
                "label": "投融资",
                "children": [
                    {
                        "value": "12000200010000",
                        "parent": "12000200000000",
                        "label": "并购",
                        "children": []
                    },
                    {
                        "value": "12000200020000",
                        "parent": "12000200000000",
                        "label": "操盘手",
                        "children": []
                    },
                    {
                        "value": "12000200030000",
                        "parent": "12000200000000",
                        "label": "股权投资",
                        "children": []
                    },
                    {
                        "value": "12000200040000",
                        "parent": "12000200000000",
                        "label": "行业研究",
                        "children": []
                    },
                    {
                        "value": "12000200050000",
                        "parent": "12000200000000",
                        "label": "基金项目经理",
                        "children": []
                    },
                    {
                        "value": "12000200060000",
                        "parent": "12000200000000",
                        "label": "基金销售",
                        "children": []
                    },
                    {
                        "value": "12000200070000",
                        "parent": "12000200000000",
                        "label": "交易员",
                        "children": []
                    },
                    {
                        "value": "12000200080000",
                        "parent": "12000200000000",
                        "label": "金融/经济研究员",
                        "children": []
                    },
                    {
                        "value": "12000200090000",
                        "parent": "12000200000000",
                        "label": "融资",
                        "children": []
                    },
                    {
                        "value": "12000200100000",
                        "parent": "12000200000000",
                        "label": "融资总监",
                        "children": []
                    },
                    {
                        "value": "12000200110000",
                        "parent": "12000200000000",
                        "label": "投行财务分析",
                        "children": []
                    },
                    {
                        "value": "12000200120000",
                        "parent": "12000200000000",
                        "label": "投行业务",
                        "children": []
                    },
                    {
                        "value": "12000200130000",
                        "parent": "12000200000000",
                        "label": "投后管理",
                        "children": []
                    },
                    {
                        "value": "12000200140000",
                        "parent": "12000200000000",
                        "label": "投融资",
                        "children": []
                    },
                    {
                        "value": "12000200150000",
                        "parent": "12000200000000",
                        "label": "投资经理",
                        "children": []
                    },
                    {
                        "value": "12000200160000",
                        "parent": "12000200000000",
                        "label": "投资者关系",
                        "children": []
                    },
                    {
                        "value": "12000200170000",
                        "parent": "12000200000000",
                        "label": "投资总监",
                        "children": []
                    },
                    {
                        "value": "12000200180000",
                        "parent": "12000200000000",
                        "label": "证券分析",
                        "children": []
                    },
                    {
                        "value": "12000200210000",
                        "parent": "12000200000000",
                        "label": "证券分析/金融研究",
                        "children": []
                    },
                    {
                        "value": "12000200190000",
                        "parent": "12000200000000",
                        "label": "证券经纪人",
                        "children": []
                    },
                    {
                        "value": "12000200200000",
                        "parent": "12000200000000",
                        "label": "资产评估",
                        "children": []
                    }
                ]
            },
            {
                "value": "12000100000000",
                "parent": "12000000000000",
                "label": "保险",
                "children": [
                    {
                        "value": "12000100010000",
                        "parent": "12000100000000",
                        "label": "保险产品开发",
                        "children": []
                    },
                    {
                        "value": "12000100040000",
                        "parent": "12000100000000",
                        "label": "保险核安",
                        "children": []
                    },
                    {
                        "value": "12000100050000",
                        "parent": "12000100000000",
                        "label": "保险精算师",
                        "children": []
                    },
                    {
                        "value": "12000100070000",
                        "parent": "12000100000000",
                        "label": "保险培训师",
                        "children": []
                    },
                    {
                        "value": "12000100080000",
                        "parent": "12000100000000",
                        "label": "保险契约管理",
                        "children": []
                    },
                    {
                        "value": "12000100090000",
                        "parent": "12000100000000",
                        "label": "保险受理员",
                        "children": []
                    },
                    {
                        "value": "12000100100000",
                        "parent": "12000100000000",
                        "label": "保险项目策划",
                        "children": []
                    },
                    {
                        "value": "12000100120000",
                        "parent": "12000100000000",
                        "label": "财产险公估师",
                        "children": []
                    },
                    {
                        "value": "12000100130000",
                        "parent": "12000100000000",
                        "label": "车险勘查",
                        "children": []
                    },
                    {
                        "value": "12000100140000",
                        "parent": "12000100000000",
                        "label": "车险专员",
                        "children": []
                    },
                    {
                        "value": "12000100150000",
                        "parent": "12000100000000",
                        "label": "核保理赔",
                        "children": []
                    },
                    {
                        "value": "12000100160000",
                        "parent": "12000100000000",
                        "label": "普通寿险理赔调查员",
                        "children": []
                    },
                    {
                        "value": "12000100170000",
                        "parent": "12000100000000",
                        "label": "汽车定损/车险理赔",
                        "children": []
                    },
                    {
                        "value": "12000100180000",
                        "parent": "12000100000000",
                        "label": "续保专员",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "15000000000000",
        "parent": '',
        "label": "生产制造/营运管理",
        "children": [
            {
                "value": "15000100000000",
                "parent": "15000000000000",
                "label": "普工/技工",
                "children": [
                    {
                        "value": "15000100010000",
                        "parent": "15000100000000",
                        "label": "cnc操作工",
                        "children": []
                    },
                    {
                        "value": "15000100030000",
                        "parent": "15000100000000",
                        "label": "包装工",
                        "children": []
                    },
                    {
                        "value": "15000100040000",
                        "parent": "15000100000000",
                        "label": "裱胶工",
                        "children": []
                    },
                    {
                        "value": "15000100050000",
                        "parent": "15000100000000",
                        "label": "裁床",
                        "children": []
                    },
                    {
                        "value": "15000100060000",
                        "parent": "15000100000000",
                        "label": "操作工",
                        "children": []
                    },
                    {
                        "value": "15000100070000",
                        "parent": "15000100000000",
                        "label": "车床/磨床/铣床/冲床工",
                        "children": []
                    },
                    {
                        "value": "15000100080000",
                        "parent": "15000100000000",
                        "label": "打稿机操作员",
                        "children": []
                    },
                    {
                        "value": "15000100090000",
                        "parent": "15000100000000",
                        "label": "挡车工",
                        "children": []
                    },
                    {
                        "value": "15000100100000",
                        "parent": "15000100000000",
                        "label": "电分操作员",
                        "children": []
                    },
                    {
                        "value": "15000100110000",
                        "parent": "15000100000000",
                        "label": "电焊工/铆焊工",
                        "children": []
                    },
                    {
                        "value": "15000100120000",
                        "parent": "15000100000000",
                        "label": "电脑放码员",
                        "children": []
                    },
                    {
                        "value": "15000100130000",
                        "parent": "15000100000000",
                        "label": "纺织工/针织工",
                        "children": []
                    },
                    {
                        "value": "15000100140000",
                        "parent": "15000100000000",
                        "label": "缝纫工",
                        "children": []
                    },
                    {
                        "value": "15000100150000",
                        "parent": "15000100000000",
                        "label": "服装打样/制版",
                        "children": []
                    },
                    {
                        "value": "15000100160000",
                        "parent": "15000100000000",
                        "label": "浮法操作工(玻璃技术)",
                        "children": []
                    },
                    {
                        "value": "15000100170000",
                        "parent": "15000100000000",
                        "label": "复卷工",
                        "children": []
                    },
                    {
                        "value": "15000100180000",
                        "parent": "15000100000000",
                        "label": "机电技师",
                        "children": []
                    },
                    {
                        "value": "15000100190000",
                        "parent": "15000100000000",
                        "label": "技工",
                        "children": []
                    },
                    {
                        "value": "15000100200000",
                        "parent": "15000100000000",
                        "label": "剪裁工",
                        "children": []
                    },
                    {
                        "value": "15000100210000",
                        "parent": "15000100000000",
                        "label": "浆纱工",
                        "children": []
                    },
                    {
                        "value": "15000100220000",
                        "parent": "15000100000000",
                        "label": "铆工",
                        "children": []
                    },
                    {
                        "value": "15000100230000",
                        "parent": "15000100000000",
                        "label": "模具工",
                        "children": []
                    },
                    {
                        "value": "15000100240000",
                        "parent": "15000100000000",
                        "label": "磨工",
                        "children": []
                    },
                    {
                        "value": "15000100250000",
                        "parent": "15000100000000",
                        "label": "配色",
                        "children": []
                    },
                    {
                        "value": "15000100260000",
                        "parent": "15000100000000",
                        "label": "漂染工",
                        "children": []
                    },
                    {
                        "value": "15000100270000",
                        "parent": "15000100000000",
                        "label": "普工/操作工",
                        "children": []
                    },
                    {
                        "value": "15000100280000",
                        "parent": "15000100000000",
                        "label": "漆工",
                        "children": []
                    },
                    {
                        "value": "15000100290000",
                        "parent": "15000100000000",
                        "label": "汽车电工",
                        "children": []
                    },
                    {
                        "value": "15000100300000",
                        "parent": "15000100000000",
                        "label": "钳工/机修工/钣金工",
                        "children": []
                    },
                    {
                        "value": "15000100310000",
                        "parent": "15000100000000",
                        "label": "切纸机操作工",
                        "children": []
                    },
                    {
                        "value": "15000100320000",
                        "parent": "15000100000000",
                        "label": "晒版员",
                        "children": []
                    },
                    {
                        "value": "15000100330000",
                        "parent": "15000100000000",
                        "label": "生产工人",
                        "children": []
                    },
                    {
                        "value": "15000100340000",
                        "parent": "15000100000000",
                        "label": "数控操作",
                        "children": []
                    },
                    {
                        "value": "15000100350000",
                        "parent": "15000100000000",
                        "label": "数码直印/菲林输出",
                        "children": []
                    },
                    {
                        "value": "15000100360000",
                        "parent": "15000100000000",
                        "label": "烫金工",
                        "children": []
                    },
                    {
                        "value": "15000100370000",
                        "parent": "15000100000000",
                        "label": "调墨技师",
                        "children": []
                    },
                    {
                        "value": "15000100380000",
                        "parent": "15000100000000",
                        "label": "调色员",
                        "children": []
                    },
                    {
                        "value": "15000100390000",
                        "parent": "15000100000000",
                        "label": "铣工",
                        "children": []
                    },
                    {
                        "value": "15000100400000",
                        "parent": "15000100000000",
                        "label": "细纱工",
                        "children": []
                    },
                    {
                        "value": "15000100410000",
                        "parent": "15000100000000",
                        "label": "压痕工",
                        "children": []
                    },
                    {
                        "value": "15000100420000",
                        "parent": "15000100000000",
                        "label": "氩弧焊工",
                        "children": []
                    },
                    {
                        "value": "15000100430000",
                        "parent": "15000100000000",
                        "label": "样衣工",
                        "children": []
                    },
                    {
                        "value": "15000100440000",
                        "parent": "15000100000000",
                        "label": "仪表工",
                        "children": []
                    },
                    {
                        "value": "15000100450000",
                        "parent": "15000100000000",
                        "label": "印染工",
                        "children": []
                    },
                    {
                        "value": "15000100460000",
                        "parent": "15000100000000",
                        "label": "印刷操作",
                        "children": []
                    },
                    {
                        "value": "15000100470000",
                        "parent": "15000100000000",
                        "label": "印刷机械机长",
                        "children": []
                    },
                    {
                        "value": "15000100480000",
                        "parent": "15000100000000",
                        "label": "印刷排版/制版",
                        "children": []
                    },
                    {
                        "value": "15000100490000",
                        "parent": "15000100000000",
                        "label": "折弯工",
                        "children": []
                    },
                    {
                        "value": "15000100500000",
                        "parent": "15000100000000",
                        "label": "整经工",
                        "children": []
                    },
                    {
                        "value": "15000100510000",
                        "parent": "15000100000000",
                        "label": "纸样师/车板师",
                        "children": []
                    },
                    {
                        "value": "15000100520000",
                        "parent": "15000100000000",
                        "label": "注塑工",
                        "children": []
                    },
                    {
                        "value": "15000100530000",
                        "parent": "15000100000000",
                        "label": "装订工",
                        "children": []
                    },
                    {
                        "value": "15000100540000",
                        "parent": "15000100000000",
                        "label": "组装工",
                        "children": []
                    },
                    {
                        "value": "15000100020000",
                        "parent": "15000100000000",
                        "label": "钻工",
                        "children": []
                    }
                ]
            },
            {
                "value": "15000400000000",
                "parent": "15000000000000",
                "label": "生产质量管理",
                "children": [
                    {
                        "value": "15000400010000",
                        "parent": "15000400000000",
                        "label": "QA工程师",
                        "children": []
                    },
                    {
                        "value": "15000400020000",
                        "parent": "15000400000000",
                        "label": "QA专员",
                        "children": []
                    },
                    {
                        "value": "15000400030000",
                        "parent": "15000400000000",
                        "label": "QC质检",
                        "children": []
                    },
                    {
                        "value": "15000400040000",
                        "parent": "15000400000000",
                        "label": "采样技术员",
                        "children": []
                    },
                    {
                        "value": "15000400050000",
                        "parent": "15000400000000",
                        "label": "服装/纺织品/皮革质量管理",
                        "children": []
                    },
                    {
                        "value": "15000400060000",
                        "parent": "15000400000000",
                        "label": "化验工程师",
                        "children": []
                    },
                    {
                        "value": "15000400070000",
                        "parent": "15000400000000",
                        "label": "计量工程师",
                        "children": []
                    },
                    {
                        "value": "15000400080000",
                        "parent": "15000400000000",
                        "label": "技术文档工程师",
                        "children": []
                    },
                    {
                        "value": "15000400090000",
                        "parent": "15000400000000",
                        "label": "检测",
                        "children": []
                    },
                    {
                        "value": "15000400100000",
                        "parent": "15000400000000",
                        "label": "可靠度工程师",
                        "children": []
                    },
                    {
                        "value": "15000400110000",
                        "parent": "15000400000000",
                        "label": "品控/品质主管",
                        "children": []
                    },
                    {
                        "value": "15000400120000",
                        "parent": "15000400000000",
                        "label": "汽车质量管理/检验检测",
                        "children": []
                    },
                    {
                        "value": "15000400130000",
                        "parent": "15000400000000",
                        "label": "药品生产/质量管理",
                        "children": []
                    },
                    {
                        "value": "15000400140000",
                        "parent": "15000400000000",
                        "label": "医疗器械生产/质量管理",
                        "children": []
                    },
                    {
                        "value": "15000400150000",
                        "parent": "15000400000000",
                        "label": "质检员",
                        "children": []
                    },
                    {
                        "value": "15000400160000",
                        "parent": "15000400000000",
                        "label": "质量管理/测试",
                        "children": []
                    },
                    {
                        "value": "15000400170000",
                        "parent": "15000400000000",
                        "label": "质量体系工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "15000300000000",
                "parent": "15000000000000",
                "label": "生产制造工程师",
                "children": [
                    {
                        "value": "15000300010000",
                        "parent": "15000300000000",
                        "label": "CNC/数控",
                        "children": []
                    },
                    {
                        "value": "15000300020000",
                        "parent": "15000300000000",
                        "label": "IE工程师",
                        "children": []
                    },
                    {
                        "value": "15000300030000",
                        "parent": "15000300000000",
                        "label": "PE工程师",
                        "children": []
                    },
                    {
                        "value": "15000300040000",
                        "parent": "15000300000000",
                        "label": "安全性能工程师",
                        "children": []
                    },
                    {
                        "value": "15000300050000",
                        "parent": "15000300000000",
                        "label": "包装工程师",
                        "children": []
                    },
                    {
                        "value": "15000300060000",
                        "parent": "15000300000000",
                        "label": "变压器与磁电工程师",
                        "children": []
                    },
                    {
                        "value": "15000300070000",
                        "parent": "15000300000000",
                        "label": "材料工程师",
                        "children": []
                    },
                    {
                        "value": "15000300080000",
                        "parent": "15000300000000",
                        "label": "产品策划工程师",
                        "children": []
                    },
                    {
                        "value": "15000300090000",
                        "parent": "15000300000000",
                        "label": "冲压工程师/技师",
                        "children": []
                    },
                    {
                        "value": "15000300100000",
                        "parent": "15000300000000",
                        "label": "电气自动化工程师",
                        "children": []
                    },
                    {
                        "value": "15000300110000",
                        "parent": "15000300000000",
                        "label": "电子/电器工程师",
                        "children": []
                    },
                    {
                        "value": "15000300120000",
                        "parent": "15000300000000",
                        "label": "动力系统设计",
                        "children": []
                    },
                    {
                        "value": "15000300130000",
                        "parent": "15000300000000",
                        "label": "服装/纺织/皮革工艺师",
                        "children": []
                    },
                    {
                        "value": "15000300140000",
                        "parent": "15000300000000",
                        "label": "高分子材料工程师",
                        "children": []
                    },
                    {
                        "value": "15000300150000",
                        "parent": "15000300000000",
                        "label": "工业工程师",
                        "children": []
                    },
                    {
                        "value": "15000300160000",
                        "parent": "15000300000000",
                        "label": "工业机器人工程师",
                        "children": []
                    },
                    {
                        "value": "15000300170000",
                        "parent": "15000300000000",
                        "label": "工艺材料工程师",
                        "children": []
                    },
                    {
                        "value": "15000300180000",
                        "parent": "15000300000000",
                        "label": "工装工程师",
                        "children": []
                    },
                    {
                        "value": "15000300190000",
                        "parent": "15000300000000",
                        "label": "故障分析工程师",
                        "children": []
                    },
                    {
                        "value": "15000300200000",
                        "parent": "15000300000000",
                        "label": "锅炉工程师/技师",
                        "children": []
                    },
                    {
                        "value": "15000300210000",
                        "parent": "15000300000000",
                        "label": "焊接工程师/技师",
                        "children": []
                    },
                    {
                        "value": "15000300220000",
                        "parent": "15000300000000",
                        "label": "机电工程师",
                        "children": []
                    },
                    {
                        "value": "15000300230000",
                        "parent": "15000300000000",
                        "label": "机械工程师",
                        "children": []
                    },
                    {
                        "value": "15000300240000",
                        "parent": "15000300000000",
                        "label": "机械工艺工程师",
                        "children": []
                    },
                    {
                        "value": "15000300250000",
                        "parent": "15000300000000",
                        "label": "机械结构工程师",
                        "children": []
                    },
                    {
                        "value": "15000300260000",
                        "parent": "15000300000000",
                        "label": "机械设备工程师",
                        "children": []
                    },
                    {
                        "value": "15000300270000",
                        "parent": "15000300000000",
                        "label": "机械制图",
                        "children": []
                    },
                    {
                        "value": "15000300280000",
                        "parent": "15000300000000",
                        "label": "激光工程师",
                        "children": []
                    },
                    {
                        "value": "15000300290000",
                        "parent": "15000300000000",
                        "label": "夹具工程师",
                        "children": []
                    },
                    {
                        "value": "15000300300000",
                        "parent": "15000300000000",
                        "label": "零部件设计",
                        "children": []
                    },
                    {
                        "value": "15000300310000",
                        "parent": "15000300000000",
                        "label": "模具工程师",
                        "children": []
                    },
                    {
                        "value": "15000300320000",
                        "parent": "15000300000000",
                        "label": "内外饰设计工程师",
                        "children": []
                    },
                    {
                        "value": "15000300330000",
                        "parent": "15000300000000",
                        "label": "暖通空调工程师",
                        "children": []
                    },
                    {
                        "value": "15000300340000",
                        "parent": "15000300000000",
                        "label": "喷涂技术员",
                        "children": []
                    },
                    {
                        "value": "15000300350000",
                        "parent": "15000300000000",
                        "label": "气动工程师",
                        "children": []
                    },
                    {
                        "value": "15000300360000",
                        "parent": "15000300000000",
                        "label": "汽车/摩托车工程师",
                        "children": []
                    },
                    {
                        "value": "15000300370000",
                        "parent": "15000300000000",
                        "label": "汽车底盘/总装工程师",
                        "children": []
                    },
                    {
                        "value": "15000300380000",
                        "parent": "15000300000000",
                        "label": "汽车电子工程师",
                        "children": []
                    },
                    {
                        "value": "15000300390000",
                        "parent": "15000300000000",
                        "label": "汽车动力系统工程师",
                        "children": []
                    },
                    {
                        "value": "15000300400000",
                        "parent": "15000300000000",
                        "label": "汽车机构工程师",
                        "children": []
                    },
                    {
                        "value": "15000300410000",
                        "parent": "15000300000000",
                        "label": "汽车机械工程师",
                        "children": []
                    },
                    {
                        "value": "15000300420000",
                        "parent": "15000300000000",
                        "label": "汽车装配工艺工程师",
                        "children": []
                    },
                    {
                        "value": "15000300430000",
                        "parent": "15000300000000",
                        "label": "热能工程师",
                        "children": []
                    },
                    {
                        "value": "15000300440000",
                        "parent": "15000300000000",
                        "label": "生产工程师",
                        "children": []
                    },
                    {
                        "value": "15000300450000",
                        "parent": "15000300000000",
                        "label": "生产技术员",
                        "children": []
                    },
                    {
                        "value": "15000300460000",
                        "parent": "15000300000000",
                        "label": "试验工程师",
                        "children": []
                    },
                    {
                        "value": "15000300470000",
                        "parent": "15000300000000",
                        "label": "数控编程",
                        "children": []
                    },
                    {
                        "value": "15000300480000",
                        "parent": "15000300000000",
                        "label": "塑料工程师",
                        "children": []
                    },
                    {
                        "value": "15000300490000",
                        "parent": "15000300000000",
                        "label": "涂料研发",
                        "children": []
                    },
                    {
                        "value": "15000300500000",
                        "parent": "15000300000000",
                        "label": "橡胶工程师",
                        "children": []
                    },
                    {
                        "value": "15000300510000",
                        "parent": "15000300000000",
                        "label": "液压工程师",
                        "children": []
                    },
                    {
                        "value": "15000300520000",
                        "parent": "15000300000000",
                        "label": "仪器/仪表/计量工程师",
                        "children": []
                    },
                    {
                        "value": "15000300530000",
                        "parent": "15000300000000",
                        "label": "制程工程师",
                        "children": []
                    },
                    {
                        "value": "15000300540000",
                        "parent": "15000300000000",
                        "label": "制造工程师",
                        "children": []
                    },
                    {
                        "value": "15000300550000",
                        "parent": "15000300000000",
                        "label": "注塑工程师",
                        "children": []
                    },
                    {
                        "value": "15000300560000",
                        "parent": "15000300000000",
                        "label": "铸造/锻造工程师/技师",
                        "children": []
                    },
                    {
                        "value": "15000300570000",
                        "parent": "15000300000000",
                        "label": "转播工程师",
                        "children": []
                    },
                    {
                        "value": "15000300580000",
                        "parent": "15000300000000",
                        "label": "装配工程师/客户经理",
                        "children": []
                    },
                    {
                        "value": "15000300590000",
                        "parent": "15000300000000",
                        "label": "自动化工程师",
                        "children": []
                    },
                    {
                        "value": "15000300600000",
                        "parent": "15000300000000",
                        "label": "总装工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "15000200000000",
                "parent": "15000000000000",
                "label": "生产管理",
                "children": [
                    {
                        "value": "15000200010000",
                        "parent": "15000200000000",
                        "label": "车间主任",
                        "children": []
                    },
                    {
                        "value": "15000200020000",
                        "parent": "15000200000000",
                        "label": "工程机械经理",
                        "children": []
                    },
                    {
                        "value": "15000200030000",
                        "parent": "15000200000000",
                        "label": "工程机械主管",
                        "children": []
                    },
                    {
                        "value": "15000200050000",
                        "parent": "15000200000000",
                        "label": "机械设备经理",
                        "children": []
                    },
                    {
                        "value": "15000200060000",
                        "parent": "15000200000000",
                        "label": "设备主管",
                        "children": []
                    },
                    {
                        "value": "15000200070000",
                        "parent": "15000200000000",
                        "label": "生产班长",
                        "children": []
                    },
                    {
                        "value": "15000200080000",
                        "parent": "15000200000000",
                        "label": "生产产品管理",
                        "children": []
                    },
                    {
                        "value": "15000200210000",
                        "parent": "15000200000000",
                        "label": "生产跟单",
                        "children": []
                    },
                    {
                        "value": "15000200090000",
                        "parent": "15000200000000",
                        "label": "生产计划",
                        "children": []
                    },
                    {
                        "value": "15000200100000",
                        "parent": "15000200000000",
                        "label": "生产经理",
                        "children": []
                    },
                    {
                        "value": "15000200110000",
                        "parent": "15000200000000",
                        "label": "生产设备管理",
                        "children": []
                    },
                    {
                        "value": "15000200120000",
                        "parent": "15000200000000",
                        "label": "生产物料管理（PMC）",
                        "children": []
                    },
                    {
                        "value": "15000200130000",
                        "parent": "15000200000000",
                        "label": "生产线/生产组长",
                        "children": []
                    },
                    {
                        "value": "15000200140000",
                        "parent": "15000200000000",
                        "label": "生产项目工程师",
                        "children": []
                    },
                    {
                        "value": "15000200150000",
                        "parent": "15000200000000",
                        "label": "生产运营管理",
                        "children": []
                    },
                    {
                        "value": "15000200160000",
                        "parent": "15000200000000",
                        "label": "生产主管/督导/组长",
                        "children": []
                    },
                    {
                        "value": "15000200170000",
                        "parent": "15000200000000",
                        "label": "生产总监",
                        "children": []
                    },
                    {
                        "value": "15000200180000",
                        "parent": "15000200000000",
                        "label": "生产组长/拉长",
                        "children": []
                    },
                    {
                        "value": "15000200190000",
                        "parent": "15000200000000",
                        "label": "营运经理",
                        "children": []
                    },
                    {
                        "value": "15000200200000",
                        "parent": "15000200000000",
                        "label": "营运主管",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "5000000000000",
        "parent": '',
        "label": "运营/专业分析",
        "children": [
            {
                "value": "5000100000000",
                "parent": "5000000000000",
                "label": "电商运营",
                "children": [
                    {
                        "value": "5000100010000",
                        "parent": "5000100000000",
                        "label": "电商经理/主管",
                        "children": []
                    },
                    {
                        "value": "5000100020000",
                        "parent": "5000100000000",
                        "label": "电商运营",
                        "children": []
                    },
                    {
                        "value": "5000100030000",
                        "parent": "5000100000000",
                        "label": "电商站长",
                        "children": []
                    },
                    {
                        "value": "5000100040000",
                        "parent": "5000100000000",
                        "label": "电商专员/助理",
                        "children": []
                    },
                    {
                        "value": "5000100050000",
                        "parent": "5000100000000",
                        "label": "跨境电商运营",
                        "children": []
                    },
                    {
                        "value": "5000100060000",
                        "parent": "5000100000000",
                        "label": "品类运营",
                        "children": []
                    },
                    {
                        "value": "5000100070000",
                        "parent": "5000100000000",
                        "label": "淘宝/微信运营专员/主管",
                        "children": []
                    },
                    {
                        "value": "5000100080000",
                        "parent": "5000100000000",
                        "label": "网店管理员",
                        "children": []
                    },
                    {
                        "value": "5000100090000",
                        "parent": "5000100000000",
                        "label": "网店运营",
                        "children": []
                    }
                ]
            },
            {
                "value": "5000400000000",
                "parent": "5000000000000",
                "label": "运营管理",
                "children": [
                    {
                        "value": "5000400010000",
                        "parent": "5000400000000",
                        "label": "城市运营",
                        "children": []
                    },
                    {
                        "value": "5000400020000",
                        "parent": "5000400000000",
                        "label": "店长",
                        "children": []
                    },
                    {
                        "value": "5000400030000",
                        "parent": "5000400000000",
                        "label": "网站运营总监",
                        "children": []
                    },
                    {
                        "value": "5000400040000",
                        "parent": "5000400000000",
                        "label": "运营督导",
                        "children": []
                    },
                    {
                        "value": "5000400050000",
                        "parent": "5000400000000",
                        "label": "运营管理",
                        "children": []
                    },
                    {
                        "value": "5000400060000",
                        "parent": "5000400000000",
                        "label": "运营总监",
                        "children": []
                    },
                    {
                        "value": "5000400070000",
                        "parent": "5000400000000",
                        "label": "站长",
                        "children": []
                    }
                ]
            },
            {
                "value": "5000200000000",
                "parent": "5000000000000",
                "label": "新媒体运营",
                "children": [
                    {
                        "value": "5000200010000",
                        "parent": "5000200000000",
                        "label": "内容审核",
                        "children": []
                    },
                    {
                        "value": "5000200020000",
                        "parent": "5000200000000",
                        "label": "内容运营",
                        "children": []
                    },
                    {
                        "value": "5000200030000",
                        "parent": "5000200000000",
                        "label": "微博运营",
                        "children": []
                    },
                    {
                        "value": "5000200040000",
                        "parent": "5000200000000",
                        "label": "微信运营",
                        "children": []
                    },
                    {
                        "value": "5000200050000",
                        "parent": "5000200000000",
                        "label": "新媒体编辑",
                        "children": []
                    },
                    {
                        "value": "5000200060000",
                        "parent": "5000200000000",
                        "label": "新媒体运营",
                        "children": []
                    },
                    {
                        "value": "5000200070000",
                        "parent": "5000200000000",
                        "label": "自媒体",
                        "children": []
                    }
                ]
            },
            {
                "value": "5000300000000",
                "parent": "5000000000000",
                "label": "业务运营",
                "children": [
                    {
                        "value": "5000300010000",
                        "parent": "5000300000000",
                        "label": "策略运营",
                        "children": []
                    },
                    {
                        "value": "5000300020000",
                        "parent": "5000300000000",
                        "label": "产品运营",
                        "children": []
                    },
                    {
                        "value": "5000300030000",
                        "parent": "5000300000000",
                        "label": "互联网运营",
                        "children": []
                    },
                    {
                        "value": "5000300040000",
                        "parent": "5000300000000",
                        "label": "会员运营",
                        "children": []
                    },
                    {
                        "value": "5000300050000",
                        "parent": "5000300000000",
                        "label": "活动运营",
                        "children": []
                    },
                    {
                        "value": "5000300060000",
                        "parent": "5000300000000",
                        "label": "楼面管理",
                        "children": []
                    },
                    {
                        "value": "5000300070000",
                        "parent": "5000300000000",
                        "label": "平台运营",
                        "children": []
                    },
                    {
                        "value": "5000300080000",
                        "parent": "5000300000000",
                        "label": "社交媒体运营",
                        "children": []
                    },
                    {
                        "value": "5000300090000",
                        "parent": "5000300000000",
                        "label": "社区运营",
                        "children": []
                    },
                    {
                        "value": "5000300100000",
                        "parent": "5000300000000",
                        "label": "网络运营管理",
                        "children": []
                    },
                    {
                        "value": "5000300110000",
                        "parent": "5000300000000",
                        "label": "网络运营专员/助理",
                        "children": []
                    },
                    {
                        "value": "5000300120000",
                        "parent": "5000300000000",
                        "label": "网站运营",
                        "children": []
                    },
                    {
                        "value": "5000300130000",
                        "parent": "5000300000000",
                        "label": "线下拓展运营",
                        "children": []
                    },
                    {
                        "value": "5000300140000",
                        "parent": "5000300000000",
                        "label": "销售运营",
                        "children": []
                    },
                    {
                        "value": "5000300200000",
                        "parent": "5000300000000",
                        "label": "信息流优化师",
                        "children": []
                    },
                    {
                        "value": "5000300150000",
                        "parent": "5000300000000",
                        "label": "用户运营",
                        "children": []
                    },
                    {
                        "value": "5000300160000",
                        "parent": "5000300000000",
                        "label": "游戏运营",
                        "children": []
                    },
                    {
                        "value": "5000300170000",
                        "parent": "5000300000000",
                        "label": "运营主管",
                        "children": []
                    },
                    {
                        "value": "5000300180000",
                        "parent": "5000300000000",
                        "label": "运营专员",
                        "children": []
                    },
                    {
                        "value": "5000300190000",
                        "parent": "5000300000000",
                        "label": "直播运营",
                        "children": []
                    }
                ]
            },
            {
                "value": "5000500000000",
                "parent": "5000000000000",
                "label": "专业分析",
                "children": [
                    {
                        "value": "5000500010000",
                        "parent": "5000500000000",
                        "label": "策略发展",
                        "children": []
                    },
                    {
                        "value": "5000500020000",
                        "parent": "5000500000000",
                        "label": "行业分析",
                        "children": []
                    },
                    {
                        "value": "5000500030000",
                        "parent": "5000500000000",
                        "label": "金融数据分析",
                        "children": []
                    },
                    {
                        "value": "5000500040000",
                        "parent": "5000500000000",
                        "label": "商业数据分析",
                        "children": []
                    },
                    {
                        "value": "5000500050000",
                        "parent": "5000500000000",
                        "label": "数据运营",
                        "children": []
                    },
                    {
                        "value": "5000500060000",
                        "parent": "5000500000000",
                        "label": "外汇分析师",
                        "children": []
                    },
                    {
                        "value": "5000500070000",
                        "parent": "5000500000000",
                        "label": "销售数据分析",
                        "children": []
                    },
                    {
                        "value": "5000500080000",
                        "parent": "5000500000000",
                        "label": "业务分析",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "13000000000000",
        "parent": '',
        "label": "客服/技术支持",
        "children": [
            {
                "value": "13000100000000",
                "parent": "13000000000000",
                "label": "客户服务",
                "children": [
                    {
                        "value": "13000100010000",
                        "parent": "13000100000000",
                        "label": "VIP专员",
                        "children": []
                    },
                    {
                        "value": "13000100020000",
                        "parent": "13000100000000",
                        "label": "电话客服",
                        "children": []
                    },
                    {
                        "value": "13000100030000",
                        "parent": "13000100000000",
                        "label": "电商售后服务",
                        "children": []
                    },
                    {
                        "value": "13000100040000",
                        "parent": "13000100000000",
                        "label": "房地产客服",
                        "children": []
                    },
                    {
                        "value": "13000100050000",
                        "parent": "13000100000000",
                        "label": "国际客服",
                        "children": []
                    },
                    {
                        "value": "13000100060000",
                        "parent": "13000100000000",
                        "label": "客服",
                        "children": []
                    },
                    {
                        "value": "13000100070000",
                        "parent": "13000100000000",
                        "label": "客服管家",
                        "children": []
                    },
                    {
                        "value": "13000100080000",
                        "parent": "13000100000000",
                        "label": "客服经理",
                        "children": []
                    },
                    {
                        "value": "13000100090000",
                        "parent": "13000100000000",
                        "label": "客服主管",
                        "children": []
                    },
                    {
                        "value": "13000100100000",
                        "parent": "13000100000000",
                        "label": "客服专员",
                        "children": []
                    },
                    {
                        "value": "13000100110000",
                        "parent": "13000100000000",
                        "label": "客服总监",
                        "children": []
                    },
                    {
                        "value": "13000100120000",
                        "parent": "13000100000000",
                        "label": "客户关系/投诉协调",
                        "children": []
                    },
                    {
                        "value": "13000100130000",
                        "parent": "13000100000000",
                        "label": "客户续期管理",
                        "children": []
                    },
                    {
                        "value": "13000100140000",
                        "parent": "13000100000000",
                        "label": "汽车售后服务",
                        "children": []
                    },
                    {
                        "value": "13000100150000",
                        "parent": "13000100000000",
                        "label": "网店客服",
                        "children": []
                    },
                    {
                        "value": "13000100160000",
                        "parent": "13000100000000",
                        "label": "夜班客服",
                        "children": []
                    },
                    {
                        "value": "13000100170000",
                        "parent": "13000100000000",
                        "label": "英语客服",
                        "children": []
                    },
                    {
                        "value": "13000100180000",
                        "parent": "13000100000000",
                        "label": "游戏客服",
                        "children": []
                    },
                    {
                        "value": "13000100190000",
                        "parent": "13000100000000",
                        "label": "在线网络客服",
                        "children": []
                    },
                    {
                        "value": "13000100200000",
                        "parent": "13000100000000",
                        "label": "驻外客服",
                        "children": []
                    },
                    {
                        "value": "13000100210000",
                        "parent": "13000100000000",
                        "label": "咨询热线/呼叫中心",
                        "children": []
                    }
                ]
            },
            {
                "value": "13000200000000",
                "parent": "13000000000000",
                "label": "售前售后工程师",
                "children": [
                    {
                        "value": "13000200010000",
                        "parent": "13000200000000",
                        "label": "技术服务支持",
                        "children": []
                    },
                    {
                        "value": "13000200020000",
                        "parent": "13000200000000",
                        "label": "技术支持工程师",
                        "children": []
                    },
                    {
                        "value": "13000200030000",
                        "parent": "13000200000000",
                        "label": "解决方案工程师",
                        "children": []
                    },
                    {
                        "value": "13000200040000",
                        "parent": "13000200000000",
                        "label": "客户技术支持",
                        "children": []
                    },
                    {
                        "value": "13000200050000",
                        "parent": "13000200000000",
                        "label": "软件售后工程师",
                        "children": []
                    },
                    {
                        "value": "13000200060000",
                        "parent": "13000200000000",
                        "label": "实施顾问",
                        "children": []
                    },
                    {
                        "value": "13000200070000",
                        "parent": "13000200000000",
                        "label": "售后维护",
                        "children": []
                    },
                    {
                        "value": "13000200080000",
                        "parent": "13000200000000",
                        "label": "售前/售后技术支持",
                        "children": []
                    },
                    {
                        "value": "13000200090000",
                        "parent": "13000200000000",
                        "label": "售前顾问",
                        "children": []
                    },
                    {
                        "value": "13000200100000",
                        "parent": "13000200000000",
                        "label": "售前咨询",
                        "children": []
                    },
                    {
                        "value": "13000200110000",
                        "parent": "13000200000000",
                        "label": "医疗器械售后工程师",
                        "children": []
                    },
                    {
                        "value": "13000200120000",
                        "parent": "13000200000000",
                        "label": "硬件售后工程师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "2000000000000",
        "parent": '',
        "label": "物流/采购/供应链",
        "children": [
            {
                "value": "2000500000000",
                "parent": "2000000000000",
                "label": "物流规划与运维",
                "children": [
                    {
                        "value": "2000500010000",
                        "parent": "2000500000000",
                        "label": "报检员",
                        "children": []
                    },
                    {
                        "value": "2000500020000",
                        "parent": "2000500000000",
                        "label": "货运代理",
                        "children": []
                    },
                    {
                        "value": "2000500030000",
                        "parent": "2000500000000",
                        "label": "集装箱操作",
                        "children": []
                    },
                    {
                        "value": "2000500040000",
                        "parent": "2000500000000",
                        "label": "集装箱管理",
                        "children": []
                    },
                    {
                        "value": "2000500050000",
                        "parent": "2000500000000",
                        "label": "集装箱维护",
                        "children": []
                    },
                    {
                        "value": "2000500060000",
                        "parent": "2000500000000",
                        "label": "水/空/陆运操作",
                        "children": []
                    },
                    {
                        "value": "2000500070000",
                        "parent": "2000500000000",
                        "label": "物流/仓储调度",
                        "children": []
                    },
                    {
                        "value": "2000500080000",
                        "parent": "2000500000000",
                        "label": "物流跟单",
                        "children": []
                    },
                    {
                        "value": "2000500090000",
                        "parent": "2000500000000",
                        "label": "物流规划",
                        "children": []
                    },
                    {
                        "value": "2000500100000",
                        "parent": "2000500000000",
                        "label": "物流监管",
                        "children": []
                    },
                    {
                        "value": "2000500110000",
                        "parent": "2000500000000",
                        "label": "物流经理/主管",
                        "children": []
                    },
                    {
                        "value": "2000500120000",
                        "parent": "2000500000000",
                        "label": "物流专员/助理",
                        "children": []
                    },
                    {
                        "value": "2000500130000",
                        "parent": "2000500000000",
                        "label": "物流总监",
                        "children": []
                    },
                    {
                        "value": "2000500140000",
                        "parent": "2000500000000",
                        "label": "运力管理",
                        "children": []
                    },
                    {
                        "value": "2000500150000",
                        "parent": "2000500000000",
                        "label": "运输调度管理",
                        "children": []
                    }
                ]
            },
            {
                "value": "2000400000000",
                "parent": "2000000000000",
                "label": "配送理货",
                "children": [
                    {
                        "value": "2000400010000",
                        "parent": "2000400000000",
                        "label": "搬运工",
                        "children": []
                    },
                    {
                        "value": "2000400020000",
                        "parent": "2000400000000",
                        "label": "快递员/速递员",
                        "children": []
                    },
                    {
                        "value": "2000400030000",
                        "parent": "2000400000000",
                        "label": "配/理/拣/发货",
                        "children": []
                    },
                    {
                        "value": "2000400040000",
                        "parent": "2000400000000",
                        "label": "配送交接员",
                        "children": []
                    },
                    {
                        "value": "2000400050000",
                        "parent": "2000400000000",
                        "label": "骑手/送餐员",
                        "children": []
                    },
                    {
                        "value": "2000400060000",
                        "parent": "2000400000000",
                        "label": "装卸工",
                        "children": []
                    }
                ]
            },
            {
                "value": "2000100000000",
                "parent": "2000000000000",
                "label": "采购/供应链/材料管理",
                "children": [
                    {
                        "value": "2000100010000",
                        "parent": "2000100000000",
                        "label": "采购/设备管理",
                        "children": []
                    },
                    {
                        "value": "2000100020000",
                        "parent": "2000100000000",
                        "label": "房地产招投标",
                        "children": []
                    },
                    {
                        "value": "2000100030000",
                        "parent": "2000100000000",
                        "label": "工程招投标",
                        "children": []
                    },
                    {
                        "value": "2000100040000",
                        "parent": "2000100000000",
                        "label": "供应链",
                        "children": []
                    },
                    {
                        "value": "2000100050000",
                        "parent": "2000100000000",
                        "label": "供应商/采购质量管理",
                        "children": []
                    },
                    {
                        "value": "2000100060000",
                        "parent": "2000100000000",
                        "label": "买手",
                        "children": []
                    },
                    {
                        "value": "2000100070000",
                        "parent": "2000100000000",
                        "label": "面料辅料开发/采购",
                        "children": []
                    },
                    {
                        "value": "2000100080000",
                        "parent": "2000100000000",
                        "label": "商务采购",
                        "children": []
                    },
                    {
                        "value": "2000100090000",
                        "parent": "2000100000000",
                        "label": "物料经理",
                        "children": []
                    },
                    {
                        "value": "2000100100000",
                        "parent": "2000100000000",
                        "label": "物料专员",
                        "children": []
                    },
                    {
                        "value": "2000100110000",
                        "parent": "2000100000000",
                        "label": "项目招投标",
                        "children": []
                    },
                    {
                        "value": "2000100120000",
                        "parent": "2000100000000",
                        "label": "医药项目招投标",
                        "children": []
                    }
                ]
            },
            {
                "value": "2000200000000",
                "parent": "2000000000000",
                "label": "仓储管理",
                "children": [
                    {
                        "value": "2000200010000",
                        "parent": "2000200000000",
                        "label": "仓储物料管理",
                        "children": []
                    },
                    {
                        "value": "2000200020000",
                        "parent": "2000200000000",
                        "label": "仓管/库管",
                        "children": []
                    },
                    {
                        "value": "2000200030000",
                        "parent": "2000200000000",
                        "label": "仓库经理/主管",
                        "children": []
                    },
                    {
                        "value": "2000200040000",
                        "parent": "2000200000000",
                        "label": "仓库文员",
                        "children": []
                    }
                ]
            },
            {
                "value": "2000300000000",
                "parent": "2000000000000",
                "label": "货运司机",
                "children": [
                    {
                        "value": "2000300010000",
                        "parent": "2000300000000",
                        "label": "吊车司机",
                        "children": []
                    },
                    {
                        "value": "2000300020000",
                        "parent": "2000300000000",
                        "label": "货车司机",
                        "children": []
                    },
                    {
                        "value": "2000300030000",
                        "parent": "2000300000000",
                        "label": "货运司机",
                        "children": []
                    },
                    {
                        "value": "2000300040000",
                        "parent": "2000300000000",
                        "label": "卡车司机",
                        "children": []
                    },
                    {
                        "value": "2000300050000",
                        "parent": "2000300000000",
                        "label": "危化品司机",
                        "children": []
                    },
                    {
                        "value": "2000300060000",
                        "parent": "2000300000000",
                        "label": "油罐车司机",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "6000000000000",
        "parent": '',
        "label": "商务服务/生活服务",
        "children": [
            {
                "value": "6001400000000",
                "parent": "6000000000000",
                "label": "商务服务",
                "children": [
                    {
                        "value": "6001400010000",
                        "parent": "6001400000000",
                        "label": "IT咨询顾问",
                        "children": []
                    },
                    {
                        "value": "6001400020000",
                        "parent": "6001400000000",
                        "label": "财务咨询顾问",
                        "children": []
                    },
                    {
                        "value": "6001400030000",
                        "parent": "6001400000000",
                        "label": "猎头顾问",
                        "children": []
                    },
                    {
                        "value": "6001400040000",
                        "parent": "6001400000000",
                        "label": "企业管理咨询",
                        "children": []
                    },
                    {
                        "value": "6001400050000",
                        "parent": "6001400000000",
                        "label": "药品注册",
                        "children": []
                    },
                    {
                        "value": "6001400060000",
                        "parent": "6001400000000",
                        "label": "医疗器械注册",
                        "children": []
                    },
                    {
                        "value": "6001400070000",
                        "parent": "6001400000000",
                        "label": "战略咨询",
                        "children": []
                    },
                    {
                        "value": "6001400080000",
                        "parent": "6001400000000",
                        "label": "知识产权/专利顾问/代理人",
                        "children": []
                    },
                    {
                        "value": "6001400090000",
                        "parent": "6001400000000",
                        "label": "专利代理",
                        "children": []
                    },
                    {
                        "value": "6001400100000",
                        "parent": "6001400000000",
                        "label": "咨询顾问",
                        "children": []
                    },
                    {
                        "value": "6001400110000",
                        "parent": "6001400000000",
                        "label": "咨询师",
                        "children": []
                    },
                    {
                        "value": "6001400120000",
                        "parent": "6001400000000",
                        "label": "咨询主管",
                        "children": []
                    },
                    {
                        "value": "6001400130000",
                        "parent": "6001400000000",
                        "label": "咨询总监",
                        "children": []
                    }
                ]
            },
            {
                "value": "6001200000000",
                "parent": "6000000000000",
                "label": "维修",
                "children": [
                    {
                        "value": "6001200010000",
                        "parent": "6001200000000",
                        "label": "电器维修工",
                        "children": []
                    },
                    {
                        "value": "6001200020000",
                        "parent": "6001200000000",
                        "label": "电子/电器维修/保养",
                        "children": []
                    },
                    {
                        "value": "6001200030000",
                        "parent": "6001200000000",
                        "label": "计算机维修",
                        "children": []
                    },
                    {
                        "value": "6001200040000",
                        "parent": "6001200000000",
                        "label": "家电维修",
                        "children": []
                    },
                    {
                        "value": "6001200050000",
                        "parent": "6001200000000",
                        "label": "纱窗维修",
                        "children": []
                    },
                    {
                        "value": "6001200060000",
                        "parent": "6001200000000",
                        "label": "手机维修",
                        "children": []
                    },
                    {
                        "value": "6001200070000",
                        "parent": "6001200000000",
                        "label": "水电维修",
                        "children": []
                    },
                    {
                        "value": "6001200080000",
                        "parent": "6001200000000",
                        "label": "维修经理/主管",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000100000000",
                "parent": "6000000000000",
                "label": "物业/安保",
                "children": [
                    {
                        "value": "6000100010000",
                        "parent": "6000100000000",
                        "label": "安检",
                        "children": []
                    },
                    {
                        "value": "6000100020000",
                        "parent": "6000100000000",
                        "label": "安全员",
                        "children": []
                    },
                    {
                        "value": "6000100030000",
                        "parent": "6000100000000",
                        "label": "保安",
                        "children": []
                    },
                    {
                        "value": "6000100040000",
                        "parent": "6000100000000",
                        "label": "保安经理",
                        "children": []
                    },
                    {
                        "value": "6000100050000",
                        "parent": "6000100000000",
                        "label": "防损员/内保",
                        "children": []
                    },
                    {
                        "value": "6000100060000",
                        "parent": "6000100000000",
                        "label": "辅警",
                        "children": []
                    },
                    {
                        "value": "6000100070000",
                        "parent": "6000100000000",
                        "label": "监控维护",
                        "children": []
                    },
                    {
                        "value": "6000100080000",
                        "parent": "6000100000000",
                        "label": "交通管理员",
                        "children": []
                    },
                    {
                        "value": "6000100090000",
                        "parent": "6000100000000",
                        "label": "门卫",
                        "children": []
                    },
                    {
                        "value": "6000100100000",
                        "parent": "6000100000000",
                        "label": "物业管家",
                        "children": []
                    },
                    {
                        "value": "6000100110000",
                        "parent": "6000100000000",
                        "label": "物业管理",
                        "children": []
                    },
                    {
                        "value": "6000100120000",
                        "parent": "6000100000000",
                        "label": "物业管理专员",
                        "children": []
                    },
                    {
                        "value": "6000100130000",
                        "parent": "6000100000000",
                        "label": "物业维修",
                        "children": []
                    },
                    {
                        "value": "6000100140000",
                        "parent": "6000100000000",
                        "label": "协警",
                        "children": []
                    },
                    {
                        "value": "6000100150000",
                        "parent": "6000100000000",
                        "label": "押运",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000500000000",
                "parent": "6000000000000",
                "label": "服务员",
                "children": [
                    {
                        "value": "6000500010000",
                        "parent": "6000500000000",
                        "label": "餐厅大堂经理",
                        "children": []
                    },
                    {
                        "value": "6000500020000",
                        "parent": "6000500000000",
                        "label": "餐厅服务员",
                        "children": []
                    },
                    {
                        "value": "6000500030000",
                        "parent": "6000500000000",
                        "label": "传菜员",
                        "children": []
                    },
                    {
                        "value": "6000500040000",
                        "parent": "6000500000000",
                        "label": "服务员",
                        "children": []
                    },
                    {
                        "value": "6000500050000",
                        "parent": "6000500000000",
                        "label": "加油站工作员",
                        "children": []
                    },
                    {
                        "value": "6000500060000",
                        "parent": "6000500000000",
                        "label": "礼仪迎宾",
                        "children": []
                    },
                    {
                        "value": "6000500070000",
                        "parent": "6000500000000",
                        "label": "领班",
                        "children": []
                    },
                    {
                        "value": "6000500080000",
                        "parent": "6000500000000",
                        "label": "收费员",
                        "children": []
                    },
                    {
                        "value": "6000500090000",
                        "parent": "6000500000000",
                        "label": "收银",
                        "children": []
                    },
                    {
                        "value": "6000500100000",
                        "parent": "6000500000000",
                        "label": "售票员",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000700000000",
                "parent": "6000000000000",
                "label": "驾驶员/司机",
                "children": [
                    {
                        "value": "6000700010000",
                        "parent": "6000700000000",
                        "label": "出租车驾驶员",
                        "children": []
                    },
                    {
                        "value": "6000700020000",
                        "parent": "6000700000000",
                        "label": "船舶驾驶/操作",
                        "children": []
                    },
                    {
                        "value": "6000700030000",
                        "parent": "6000700000000",
                        "label": "大巴司机",
                        "children": []
                    },
                    {
                        "value": "6000700040000",
                        "parent": "6000700000000",
                        "label": "代驾",
                        "children": []
                    },
                    {
                        "value": "6000700050000",
                        "parent": "6000700000000",
                        "label": "飞机驾驶/操作",
                        "children": []
                    },
                    {
                        "value": "6000700060000",
                        "parent": "6000700000000",
                        "label": "机动车司机/驾驶",
                        "children": []
                    },
                    {
                        "value": "6000700070000",
                        "parent": "6000700000000",
                        "label": "列车驾驶/操作",
                        "children": []
                    },
                    {
                        "value": "6000700080000",
                        "parent": "6000700000000",
                        "label": "商务专职司机",
                        "children": []
                    },
                    {
                        "value": "6000700090000",
                        "parent": "6000700000000",
                        "label": "通勤司机",
                        "children": []
                    },
                    {
                        "value": "6000700100000",
                        "parent": "6000700000000",
                        "label": "网约车司机",
                        "children": []
                    },
                    {
                        "value": "6000700110000",
                        "parent": "6000700000000",
                        "label": "校车司机",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000600000000",
                "parent": "6000000000000",
                "label": "家政保洁",
                "children": [
                    {
                        "value": "6000600010000",
                        "parent": "6000600000000",
                        "label": "保洁",
                        "children": []
                    },
                    {
                        "value": "6000600020000",
                        "parent": "6000600000000",
                        "label": "家政",
                        "children": []
                    },
                    {
                        "value": "6000600030000",
                        "parent": "6000600000000",
                        "label": "钟点工",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000300000000",
                "parent": "6000000000000",
                "label": "乘服",
                "children": [
                    {
                        "value": "6000300010000",
                        "parent": "6000300000000",
                        "label": "船舶乘务",
                        "children": []
                    },
                    {
                        "value": "6000300020000",
                        "parent": "6000300000000",
                        "label": "船员/水手",
                        "children": []
                    },
                    {
                        "value": "6000300030000",
                        "parent": "6000300000000",
                        "label": "地铁站务员",
                        "children": []
                    },
                    {
                        "value": "6000300040000",
                        "parent": "6000300000000",
                        "label": "高铁乘务",
                        "children": []
                    },
                    {
                        "value": "6000300050000",
                        "parent": "6000300000000",
                        "label": "公交/地铁乘务",
                        "children": []
                    },
                    {
                        "value": "6000300060000",
                        "parent": "6000300000000",
                        "label": "航空乘务",
                        "children": []
                    },
                    {
                        "value": "6000300070000",
                        "parent": "6000300000000",
                        "label": "机场地勤人员",
                        "children": []
                    },
                    {
                        "value": "6000300080000",
                        "parent": "6000300000000",
                        "label": "列车乘务",
                        "children": []
                    },
                    {
                        "value": "6000300090000",
                        "parent": "6000300000000",
                        "label": "邮轮乘务",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000400000000",
                "parent": "6000000000000",
                "label": "厨师/厨工",
                "children": [
                    {
                        "value": "6000400010000",
                        "parent": "6000400000000",
                        "label": "裱花师",
                        "children": []
                    },
                    {
                        "value": "6000400020000",
                        "parent": "6000400000000",
                        "label": "茶艺师",
                        "children": []
                    },
                    {
                        "value": "6000400030000",
                        "parent": "6000400000000",
                        "label": "厨工/帮厨",
                        "children": []
                    },
                    {
                        "value": "6000400040000",
                        "parent": "6000400000000",
                        "label": "厨师",
                        "children": []
                    },
                    {
                        "value": "6000400050000",
                        "parent": "6000400000000",
                        "label": "厨师助理/厨工",
                        "children": []
                    },
                    {
                        "value": "6000400060000",
                        "parent": "6000400000000",
                        "label": "蛋糕师",
                        "children": []
                    },
                    {
                        "value": "6000400070000",
                        "parent": "6000400000000",
                        "label": "行政主厨/厨师长",
                        "children": []
                    },
                    {
                        "value": "6000400080000",
                        "parent": "6000400000000",
                        "label": "烘焙师",
                        "children": []
                    },
                    {
                        "value": "6000400090000",
                        "parent": "6000400000000",
                        "label": "烘焙厨工",
                        "children": []
                    },
                    {
                        "value": "6000400100000",
                        "parent": "6000400000000",
                        "label": "咖啡师",
                        "children": []
                    },
                    {
                        "value": "6000400110000",
                        "parent": "6000400000000",
                        "label": "面点师",
                        "children": []
                    },
                    {
                        "value": "6000400120000",
                        "parent": "6000400000000",
                        "label": "切配工",
                        "children": []
                    },
                    {
                        "value": "6000400130000",
                        "parent": "6000400000000",
                        "label": "日餐厨工",
                        "children": []
                    },
                    {
                        "value": "6000400140000",
                        "parent": "6000400000000",
                        "label": "日式厨师",
                        "children": []
                    },
                    {
                        "value": "6000400150000",
                        "parent": "6000400000000",
                        "label": "烧烤师",
                        "children": []
                    },
                    {
                        "value": "6000400160000",
                        "parent": "6000400000000",
                        "label": "生鲜食品加工/处理",
                        "children": []
                    },
                    {
                        "value": "6000400170000",
                        "parent": "6000400000000",
                        "label": "食品加工/处理",
                        "children": []
                    },
                    {
                        "value": "6000400180000",
                        "parent": "6000400000000",
                        "label": "甜品师",
                        "children": []
                    },
                    {
                        "value": "6000400190000",
                        "parent": "6000400000000",
                        "label": "调酒师",
                        "children": []
                    },
                    {
                        "value": "6000400200000",
                        "parent": "6000400000000",
                        "label": "西餐厨师",
                        "children": []
                    },
                    {
                        "value": "6000400210000",
                        "parent": "6000400000000",
                        "label": "西餐厨工",
                        "children": []
                    },
                    {
                        "value": "6000400220000",
                        "parent": "6000400000000",
                        "label": "西点师",
                        "children": []
                    },
                    {
                        "value": "6000400230000",
                        "parent": "6000400000000",
                        "label": "洗碗工",
                        "children": []
                    },
                    {
                        "value": "6000400240000",
                        "parent": "6000400000000",
                        "label": "中餐厨师",
                        "children": []
                    },
                    {
                        "value": "6000400250000",
                        "parent": "6000400000000",
                        "label": "中餐厨工",
                        "children": []
                    },
                    {
                        "value": "6000400260000",
                        "parent": "6000400000000",
                        "label": "中点师",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000900000000",
                "parent": "6000000000000",
                "label": "旅游服务",
                "children": [
                    {
                        "value": "6000900010000",
                        "parent": "6000900000000",
                        "label": "出境操作",
                        "children": []
                    },
                    {
                        "value": "6000900020000",
                        "parent": "6000900000000",
                        "label": "导游",
                        "children": []
                    },
                    {
                        "value": "6000900030000",
                        "parent": "6000900000000",
                        "label": "酒店试睡员",
                        "children": []
                    },
                    {
                        "value": "6000900040000",
                        "parent": "6000900000000",
                        "label": "旅游产品/线路策划",
                        "children": []
                    },
                    {
                        "value": "6000900050000",
                        "parent": "6000900000000",
                        "label": "旅游顾问",
                        "children": []
                    },
                    {
                        "value": "6000900060000",
                        "parent": "6000900000000",
                        "label": "旅游计调",
                        "children": []
                    },
                    {
                        "value": "6000900070000",
                        "parent": "6000900000000",
                        "label": "票务",
                        "children": []
                    },
                    {
                        "value": "6000900080000",
                        "parent": "6000900000000",
                        "label": "签证业务办理",
                        "children": []
                    },
                    {
                        "value": "6000900090000",
                        "parent": "6000900000000",
                        "label": "预订员",
                        "children": []
                    }
                ]
            },
            {
                "value": "6001300000000",
                "parent": "6000000000000",
                "label": "专业服务",
                "children": [
                    {
                        "value": "6001300010000",
                        "parent": "6001300000000",
                        "label": "宠物护理和美容",
                        "children": []
                    },
                    {
                        "value": "6001300020000",
                        "parent": "6001300000000",
                        "label": "畜牧师",
                        "children": []
                    },
                    {
                        "value": "6001300190000",
                        "parent": "6001300000000",
                        "label": "典当业务",
                        "children": []
                    },
                    {
                        "value": "6001300030000",
                        "parent": "6001300000000",
                        "label": "动物营养/饲料研发",
                        "children": []
                    },
                    {
                        "value": "6001300040000",
                        "parent": "6001300000000",
                        "label": "动物育种/养殖",
                        "children": []
                    },
                    {
                        "value": "6001300050000",
                        "parent": "6001300000000",
                        "label": "二手车评估师",
                        "children": []
                    },
                    {
                        "value": "6001300060000",
                        "parent": "6001300000000",
                        "label": "房地产评估",
                        "children": []
                    },
                    {
                        "value": "6001300070000",
                        "parent": "6001300000000",
                        "label": "户外/游戏教练",
                        "children": []
                    },
                    {
                        "value": "6001300080000",
                        "parent": "6001300000000",
                        "label": "救生员",
                        "children": []
                    },
                    {
                        "value": "6001300090000",
                        "parent": "6001300000000",
                        "label": "林业技术人员",
                        "children": []
                    },
                    {
                        "value": "6001300100000",
                        "parent": "6001300000000",
                        "label": "农艺师",
                        "children": []
                    },
                    {
                        "value": "6001300110000",
                        "parent": "6001300000000",
                        "label": "拍卖师",
                        "children": []
                    },
                    {
                        "value": "6001300120000",
                        "parent": "6001300000000",
                        "label": "品酒师",
                        "children": []
                    },
                    {
                        "value": "6001300130000",
                        "parent": "6001300000000",
                        "label": "潜水员",
                        "children": []
                    },
                    {
                        "value": "6001300200000",
                        "parent": "6001300000000",
                        "label": "权证/过户",
                        "children": []
                    },
                    {
                        "value": "6001300140000",
                        "parent": "6001300000000",
                        "label": "水族馆表演演员",
                        "children": []
                    },
                    {
                        "value": "6001300150000",
                        "parent": "6001300000000",
                        "label": "拓展培训",
                        "children": []
                    },
                    {
                        "value": "6001300160000",
                        "parent": "6001300000000",
                        "label": "训犬师",
                        "children": []
                    },
                    {
                        "value": "6001300170000",
                        "parent": "6001300000000",
                        "label": "园艺师",
                        "children": []
                    },
                    {
                        "value": "6001300180000",
                        "parent": "6001300000000",
                        "label": "珠宝/收藏品鉴定",
                        "children": []
                    }
                ]
            },
            {
                "value": "6001000000000",
                "parent": "6000000000000",
                "label": "美容保健",
                "children": [
                    {
                        "value": "6001000010000",
                        "parent": "6001000000000",
                        "label": "spa技师",
                        "children": []
                    },
                    {
                        "value": "6001000020000",
                        "parent": "6001000000000",
                        "label": "按摩技师",
                        "children": []
                    },
                    {
                        "value": "6001000030000",
                        "parent": "6001000000000",
                        "label": "发型师",
                        "children": []
                    },
                    {
                        "value": "6001000040000",
                        "parent": "6001000000000",
                        "label": "理疗师",
                        "children": []
                    },
                    {
                        "value": "6001000050000",
                        "parent": "6001000000000",
                        "label": "美发师",
                        "children": []
                    },
                    {
                        "value": "6001000060000",
                        "parent": "6001000000000",
                        "label": "美甲师",
                        "children": []
                    },
                    {
                        "value": "6001000070000",
                        "parent": "6001000000000",
                        "label": "美容师",
                        "children": []
                    },
                    {
                        "value": "6001000080000",
                        "parent": "6001000000000",
                        "label": "美体师",
                        "children": []
                    },
                    {
                        "value": "6001000090000",
                        "parent": "6001000000000",
                        "label": "足疗师",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000200000000",
                "parent": "6000000000000",
                "label": "保姆/月嫂",
                "children": [
                    {
                        "value": "6000200010000",
                        "parent": "6000200000000",
                        "label": "保姆",
                        "children": []
                    },
                    {
                        "value": "6000200020000",
                        "parent": "6000200000000",
                        "label": "母婴护理师",
                        "children": []
                    },
                    {
                        "value": "6000200030000",
                        "parent": "6000200000000",
                        "label": "月嫂/育婴师",
                        "children": []
                    }
                ]
            },
            {
                "value": "6001100000000",
                "parent": "6000000000000",
                "label": "汽车美容维修",
                "children": [
                    {
                        "value": "6001100010000",
                        "parent": "6001100000000",
                        "label": "抛光",
                        "children": []
                    },
                    {
                        "value": "6001100020000",
                        "parent": "6001100000000",
                        "label": "汽车保养",
                        "children": []
                    },
                    {
                        "value": "6001100030000",
                        "parent": "6001100000000",
                        "label": "汽车玻璃专修",
                        "children": []
                    },
                    {
                        "value": "6001100040000",
                        "parent": "6001100000000",
                        "label": "汽车改装",
                        "children": []
                    },
                    {
                        "value": "6001100050000",
                        "parent": "6001100000000",
                        "label": "汽车轮胎服务",
                        "children": []
                    },
                    {
                        "value": "6001100060000",
                        "parent": "6001100000000",
                        "label": "汽车美容",
                        "children": []
                    },
                    {
                        "value": "6001100070000",
                        "parent": "6001100000000",
                        "label": "汽车喷漆",
                        "children": []
                    },
                    {
                        "value": "6001100080000",
                        "parent": "6001100000000",
                        "label": "汽车贴膜",
                        "children": []
                    },
                    {
                        "value": "6001100090000",
                        "parent": "6001100000000",
                        "label": "汽车维修",
                        "children": []
                    },
                    {
                        "value": "6001100100000",
                        "parent": "6001100000000",
                        "label": "汽车装潢",
                        "children": []
                    },
                    {
                        "value": "6001100110000",
                        "parent": "6001100000000",
                        "label": "洗车工",
                        "children": []
                    }
                ]
            },
            {
                "value": "6000800000000",
                "parent": "6000000000000",
                "label": "酒店服务",
                "children": [
                    {
                        "value": "6000800010000",
                        "parent": "6000800000000",
                        "label": "公寓管家",
                        "children": []
                    },
                    {
                        "value": "6000800020000",
                        "parent": "6000800000000",
                        "label": "贵宾服务主任",
                        "children": []
                    },
                    {
                        "value": "6000800030000",
                        "parent": "6000800000000",
                        "label": "行李员",
                        "children": []
                    },
                    {
                        "value": "6000800040000",
                        "parent": "6000800000000",
                        "label": "酒店大堂",
                        "children": []
                    },
                    {
                        "value": "6000800050000",
                        "parent": "6000800000000",
                        "label": "酒店管理",
                        "children": []
                    },
                    {
                        "value": "6000800060000",
                        "parent": "6000800000000",
                        "label": "酒店前台",
                        "children": []
                    },
                    {
                        "value": "6000800070000",
                        "parent": "6000800000000",
                        "label": "客房服务员",
                        "children": []
                    },
                    {
                        "value": "6000800080000",
                        "parent": "6000800000000",
                        "label": "客房管理",
                        "children": []
                    },
                    {
                        "value": "6000800090000",
                        "parent": "6000800000000",
                        "label": "礼宾",
                        "children": []
                    },
                    {
                        "value": "6000800100000",
                        "parent": "6000800000000",
                        "label": "民宿运营",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "8000000000000",
        "parent": '',
        "label": "管培生/非企业从业者",
        "children": [
            {
                "value": "8000300000000",
                "parent": "8000000000000",
                "label": "实习生/兼职",
                "children": [
                    {
                        "value": "8000300010000",
                        "parent": "8000300000000",
                        "label": "兼职/短时工",
                        "children": []
                    },
                    {
                        "value": "8000300020000",
                        "parent": "8000300000000",
                        "label": "临时工",
                        "children": []
                    },
                    {
                        "value": "8000300030000",
                        "parent": "8000300000000",
                        "label": "实习生",
                        "children": []
                    }
                ]
            },
            {
                "value": "8000100000000",
                "parent": "8000000000000",
                "label": "管培生/储备干部",
                "children": [
                    {
                        "value": "8000100010000",
                        "parent": "8000100000000",
                        "label": "储备干部",
                        "children": []
                    },
                    {
                        "value": "8000100020000",
                        "parent": "8000100000000",
                        "label": "储备经理人",
                        "children": []
                    },
                    {
                        "value": "8000100030000",
                        "parent": "8000100000000",
                        "label": "管培生/培训生",
                        "children": []
                    }
                ]
            },
            {
                "value": "8000200000000",
                "parent": "8000000000000",
                "label": "社工",
                "children": [
                    {
                        "value": "8000200010000",
                        "parent": "8000200000000",
                        "label": "社工",
                        "children": []
                    },
                    {
                        "value": "8000200020000",
                        "parent": "8000200000000",
                        "label": "志愿者/义工",
                        "children": []
                    }
                ]
            },
            {
                "value": "8000400000000",
                "parent": "8000000000000",
                "label": "政府及非盈利机构从业者",
                "children": [
                    {
                        "value": "8000400010000",
                        "parent": "8000400000000",
                        "label": "公共卫生",
                        "children": []
                    },
                    {
                        "value": "8000400020000",
                        "parent": "8000400000000",
                        "label": "公务员",
                        "children": []
                    },
                    {
                        "value": "8000400030000",
                        "parent": "8000400000000",
                        "label": "疾病控制",
                        "children": []
                    },
                    {
                        "value": "8000400040000",
                        "parent": "8000400000000",
                        "label": "事业单位人员",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "16000000000000",
        "parent": '',
        "label": "市场/品牌/公关",
        "children": [
            {
                "value": "16000600000000",
                "parent": "16000000000000",
                "label": "市场调研",
                "children": [
                    {
                        "value": "16000600010000",
                        "parent": "16000600000000",
                        "label": "竞品分析",
                        "children": []
                    },
                    {
                        "value": "16000600020000",
                        "parent": "16000600000000",
                        "label": "情报信息分析",
                        "children": []
                    },
                    {
                        "value": "16000600030000",
                        "parent": "16000600000000",
                        "label": "市场调研分析",
                        "children": []
                    },
                    {
                        "value": "16000600040000",
                        "parent": "16000600000000",
                        "label": "调研员",
                        "children": []
                    },
                    {
                        "value": "16000600050000",
                        "parent": "16000600000000",
                        "label": "用户研究",
                        "children": []
                    },
                    {
                        "value": "16000600060000",
                        "parent": "16000600000000",
                        "label": "舆情分析",
                        "children": []
                    }
                ]
            },
            {
                "value": "16000500000000",
                "parent": "16000000000000",
                "label": "市场/品牌推广",
                "children": [
                    {
                        "value": "16000500010000",
                        "parent": "16000500000000",
                        "label": "SEM",
                        "children": []
                    },
                    {
                        "value": "16000500020000",
                        "parent": "16000500000000",
                        "label": "SEO",
                        "children": []
                    },
                    {
                        "value": "16000500030000",
                        "parent": "16000500000000",
                        "label": "创意总监",
                        "children": []
                    },
                    {
                        "value": "16000500040000",
                        "parent": "16000500000000",
                        "label": "广告创意",
                        "children": []
                    },
                    {
                        "value": "16000500050000",
                        "parent": "16000500000000",
                        "label": "广告美术指导",
                        "children": []
                    },
                    {
                        "value": "16000500060000",
                        "parent": "16000500000000",
                        "label": "广告审核",
                        "children": []
                    },
                    {
                        "value": "16000500070000",
                        "parent": "16000500000000",
                        "label": "广告协调",
                        "children": []
                    },
                    {
                        "value": "16000500080000",
                        "parent": "16000500000000",
                        "label": "广告制作执行",
                        "children": []
                    },
                    {
                        "value": "16000500090000",
                        "parent": "16000500000000",
                        "label": "品牌策划",
                        "children": []
                    },
                    {
                        "value": "16000500100000",
                        "parent": "16000500000000",
                        "label": "品牌公关",
                        "children": []
                    },
                    {
                        "value": "16000500110000",
                        "parent": "16000500000000",
                        "label": "品牌经理",
                        "children": []
                    },
                    {
                        "value": "16000500120000",
                        "parent": "16000500000000",
                        "label": "品牌主管",
                        "children": []
                    },
                    {
                        "value": "16000500130000",
                        "parent": "16000500000000",
                        "label": "品牌专员",
                        "children": []
                    },
                    {
                        "value": "16000500140000",
                        "parent": "16000500000000",
                        "label": "市场部主管",
                        "children": []
                    },
                    {
                        "value": "16000500150000",
                        "parent": "16000500000000",
                        "label": "市场策划经理",
                        "children": []
                    },
                    {
                        "value": "16000500160000",
                        "parent": "16000500000000",
                        "label": "市场策划专员",
                        "children": []
                    },
                    {
                        "value": "16000500170000",
                        "parent": "16000500000000",
                        "label": "市场经理",
                        "children": []
                    },
                    {
                        "value": "16000500180000",
                        "parent": "16000500000000",
                        "label": "市场通路专员",
                        "children": []
                    },
                    {
                        "value": "16000500190000",
                        "parent": "16000500000000",
                        "label": "市场推广",
                        "children": []
                    },
                    {
                        "value": "16000500200000",
                        "parent": "16000500000000",
                        "label": "市场营销",
                        "children": []
                    },
                    {
                        "value": "16000500210000",
                        "parent": "16000500000000",
                        "label": "市场营销经理",
                        "children": []
                    },
                    {
                        "value": "16000500220000",
                        "parent": "16000500000000",
                        "label": "市场营销主管",
                        "children": []
                    },
                    {
                        "value": "16000500230000",
                        "parent": "16000500000000",
                        "label": "市场营销专员",
                        "children": []
                    },
                    {
                        "value": "16000500240000",
                        "parent": "16000500000000",
                        "label": "市场运营",
                        "children": []
                    },
                    {
                        "value": "16000500250000",
                        "parent": "16000500000000",
                        "label": "市场专员",
                        "children": []
                    },
                    {
                        "value": "16000500260000",
                        "parent": "16000500000000",
                        "label": "市场总监",
                        "children": []
                    },
                    {
                        "value": "16000500270000",
                        "parent": "16000500000000",
                        "label": "数字营销专员",
                        "children": []
                    },
                    {
                        "value": "16000500280000",
                        "parent": "16000500000000",
                        "label": "网络竞价专员",
                        "children": []
                    },
                    {
                        "value": "16000500290000",
                        "parent": "16000500000000",
                        "label": "网络推广",
                        "children": []
                    },
                    {
                        "value": "16000500300000",
                        "parent": "16000500000000",
                        "label": "网站推广",
                        "children": []
                    },
                    {
                        "value": "16000500310000",
                        "parent": "16000500000000",
                        "label": "微信推广",
                        "children": []
                    },
                    {
                        "value": "16000500320000",
                        "parent": "16000500000000",
                        "label": "学术推广",
                        "children": []
                    },
                    {
                        "value": "16000500330000",
                        "parent": "16000500000000",
                        "label": "药品市场推广经理/主管",
                        "children": []
                    },
                    {
                        "value": "16000500340000",
                        "parent": "16000500000000",
                        "label": "药品市场推广专员/助理",
                        "children": []
                    }
                ]
            },
            {
                "value": "16000100000000",
                "parent": "16000000000000",
                "label": "策划",
                "children": [
                    {
                        "value": "16000100010000",
                        "parent": "16000100000000",
                        "label": "广告创意/设计总监",
                        "children": []
                    },
                    {
                        "value": "16000100020000",
                        "parent": "16000100000000",
                        "label": "广告文案策划",
                        "children": []
                    },
                    {
                        "value": "16000100030000",
                        "parent": "16000100000000",
                        "label": "婚礼/庆典策划",
                        "children": []
                    },
                    {
                        "value": "16000100040000",
                        "parent": "16000100000000",
                        "label": "活动策划",
                        "children": []
                    },
                    {
                        "value": "16000100050000",
                        "parent": "16000100000000",
                        "label": "活动执行",
                        "children": []
                    },
                    {
                        "value": "16000100060000",
                        "parent": "16000100000000",
                        "label": "企划",
                        "children": []
                    },
                    {
                        "value": "16000100070000",
                        "parent": "16000100000000",
                        "label": "市场策划",
                        "children": []
                    },
                    {
                        "value": "16000100080000",
                        "parent": "16000100000000",
                        "label": "文案策划",
                        "children": []
                    },
                    {
                        "value": "16000100090000",
                        "parent": "16000100000000",
                        "label": "宣传策划",
                        "children": []
                    },
                    {
                        "value": "16000100100000",
                        "parent": "16000100000000",
                        "label": "营销策划",
                        "children": []
                    },
                    {
                        "value": "16000100110000",
                        "parent": "16000100000000",
                        "label": "展厅策划",
                        "children": []
                    }
                ]
            },
            {
                "value": "16000300000000",
                "parent": "16000000000000",
                "label": "公关媒介",
                "children": [
                    {
                        "value": "16000300010000",
                        "parent": "16000300000000",
                        "label": "公关经理/主管",
                        "children": []
                    },
                    {
                        "value": "16000300020000",
                        "parent": "16000300000000",
                        "label": "公关专员",
                        "children": []
                    },
                    {
                        "value": "16000300030000",
                        "parent": "16000300000000",
                        "label": "公关总监",
                        "children": []
                    },
                    {
                        "value": "16000300040000",
                        "parent": "16000300000000",
                        "label": "活动公关",
                        "children": []
                    },
                    {
                        "value": "16000300050000",
                        "parent": "16000300000000",
                        "label": "媒介策划",
                        "children": []
                    },
                    {
                        "value": "16000300060000",
                        "parent": "16000300000000",
                        "label": "媒介顾问",
                        "children": []
                    },
                    {
                        "value": "16000300070000",
                        "parent": "16000300000000",
                        "label": "媒介管理",
                        "children": []
                    },
                    {
                        "value": "16000300080000",
                        "parent": "16000300000000",
                        "label": "媒介合作",
                        "children": []
                    },
                    {
                        "value": "16000300090000",
                        "parent": "16000300000000",
                        "label": "媒介投放",
                        "children": []
                    },
                    {
                        "value": "16000300100000",
                        "parent": "16000300000000",
                        "label": "媒介专员",
                        "children": []
                    },
                    {
                        "value": "16000300110000",
                        "parent": "16000300000000",
                        "label": "媒介总监",
                        "children": []
                    },
                    {
                        "value": "16000300120000",
                        "parent": "16000300000000",
                        "label": "商务公关",
                        "children": []
                    },
                    {
                        "value": "16000300130000",
                        "parent": "16000300000000",
                        "label": "政府关系",
                        "children": []
                    }
                ]
            },
            {
                "value": "16000400000000",
                "parent": "16000000000000",
                "label": "会展会务",
                "children": [
                    {
                        "value": "16000400010000",
                        "parent": "16000400000000",
                        "label": "会务经理",
                        "children": []
                    },
                    {
                        "value": "16000400020000",
                        "parent": "16000400000000",
                        "label": "会务专员",
                        "children": []
                    },
                    {
                        "value": "16000400030000",
                        "parent": "16000400000000",
                        "label": "会展/会议执行",
                        "children": []
                    },
                    {
                        "value": "16000400040000",
                        "parent": "16000400000000",
                        "label": "会展策划",
                        "children": []
                    }
                ]
            },
            {
                "value": "16000200000000",
                "parent": "16000000000000",
                "label": "发行",
                "children": [
                    {
                        "value": "16000200010000",
                        "parent": "16000200000000",
                        "label": "发行管理",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "1000000000000",
        "parent": '',
        "label": "编辑/记者/翻译",
        "children": [
            {
                "value": "1000100000000",
                "parent": "1000000000000",
                "label": "编辑/编校/作家",
                "children": [
                    {
                        "value": "1000100010000",
                        "parent": "1000100000000",
                        "label": "编辑/组稿",
                        "children": []
                    },
                    {
                        "value": "1000100020000",
                        "parent": "1000100000000",
                        "label": "出版",
                        "children": []
                    },
                    {
                        "value": "1000100030000",
                        "parent": "1000100000000",
                        "label": "美编",
                        "children": []
                    },
                    {
                        "value": "1000100040000",
                        "parent": "1000100000000",
                        "label": "排版设计",
                        "children": []
                    },
                    {
                        "value": "1000100050000",
                        "parent": "1000100000000",
                        "label": "校对/录入",
                        "children": []
                    },
                    {
                        "value": "1000100060000",
                        "parent": "1000100000000",
                        "label": "主编/副主编",
                        "children": []
                    },
                    {
                        "value": "1000100070000",
                        "parent": "1000100000000",
                        "label": "作家/撰稿人",
                        "children": []
                    }
                ]
            },
            {
                "value": "1000200000000",
                "parent": "1000000000000",
                "label": "翻译",
                "children": [
                    {
                        "value": "1000200010000",
                        "parent": "1000200000000",
                        "label": "阿拉伯语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200020000",
                        "parent": "1000200000000",
                        "label": "德语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200030000",
                        "parent": "1000200000000",
                        "label": "俄语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200040000",
                        "parent": "1000200000000",
                        "label": "法语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200050000",
                        "parent": "1000200000000",
                        "label": "高级翻译",
                        "children": []
                    },
                    {
                        "value": "1000200060000",
                        "parent": "1000200000000",
                        "label": "韩语/朝鲜语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200070000",
                        "parent": "1000200000000",
                        "label": "葡萄牙语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200080000",
                        "parent": "1000200000000",
                        "label": "日语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200090000",
                        "parent": "1000200000000",
                        "label": "西班牙语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200100000",
                        "parent": "1000200000000",
                        "label": "小语种翻译",
                        "children": []
                    },
                    {
                        "value": "1000200110000",
                        "parent": "1000200000000",
                        "label": "意大利语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200120000",
                        "parent": "1000200000000",
                        "label": "英语翻译",
                        "children": []
                    },
                    {
                        "value": "1000200130000",
                        "parent": "1000200000000",
                        "label": "驻外翻译",
                        "children": []
                    }
                ]
            },
            {
                "value": "1000300000000",
                "parent": "1000000000000",
                "label": "记者/采编",
                "children": [
                    {
                        "value": "1000300010000",
                        "parent": "1000300000000",
                        "label": "采编",
                        "children": []
                    },
                    {
                        "value": "1000300020000",
                        "parent": "1000300000000",
                        "label": "记者",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "7000000000000",
        "parent": '',
        "label": "工程/建筑/安防",
        "children": [
            {
                "value": "7000400000000",
                "parent": "7000000000000",
                "label": "施工员",
                "children": [
                    {
                        "value": "7000400010000",
                        "parent": "7000400000000",
                        "label": "测量员",
                        "children": []
                    },
                    {
                        "value": "7000400020000",
                        "parent": "7000400000000",
                        "label": "叉车工",
                        "children": []
                    },
                    {
                        "value": "7000400030000",
                        "parent": "7000400000000",
                        "label": "铲车工",
                        "children": []
                    },
                    {
                        "value": "7000400040000",
                        "parent": "7000400000000",
                        "label": "电镀工",
                        "children": []
                    },
                    {
                        "value": "7000400050000",
                        "parent": "7000400000000",
                        "label": "电工",
                        "children": []
                    },
                    {
                        "value": "7000400060000",
                        "parent": "7000400000000",
                        "label": "电力线路工",
                        "children": []
                    },
                    {
                        "value": "7000400070000",
                        "parent": "7000400000000",
                        "label": "电梯安装",
                        "children": []
                    },
                    {
                        "value": "7000400080000",
                        "parent": "7000400000000",
                        "label": "钢筋工",
                        "children": []
                    },
                    {
                        "value": "7000400090000",
                        "parent": "7000400000000",
                        "label": "锅炉工",
                        "children": []
                    },
                    {
                        "value": "7000400100000",
                        "parent": "7000400000000",
                        "label": "空调工",
                        "children": []
                    },
                    {
                        "value": "7000400110000",
                        "parent": "7000400000000",
                        "label": "喷塑工",
                        "children": []
                    },
                    {
                        "value": "7000400120000",
                        "parent": "7000400000000",
                        "label": "弱电",
                        "children": []
                    },
                    {
                        "value": "7000400130000",
                        "parent": "7000400000000",
                        "label": "施工队长",
                        "children": []
                    },
                    {
                        "value": "7000400140000",
                        "parent": "7000400000000",
                        "label": "施工员",
                        "children": []
                    },
                    {
                        "value": "7000400150000",
                        "parent": "7000400000000",
                        "label": "水工/木工/油漆工",
                        "children": []
                    },
                    {
                        "value": "7000400160000",
                        "parent": "7000400000000",
                        "label": "土建工",
                        "children": []
                    },
                    {
                        "value": "7000400170000",
                        "parent": "7000400000000",
                        "label": "拖压工",
                        "children": []
                    },
                    {
                        "value": "7000400180000",
                        "parent": "7000400000000",
                        "label": "瓦工",
                        "children": []
                    },
                    {
                        "value": "7000400190000",
                        "parent": "7000400000000",
                        "label": "万能工",
                        "children": []
                    },
                    {
                        "value": "7000400200000",
                        "parent": "7000400000000",
                        "label": "施工学员",
                        "children": []
                    },
                    {
                        "value": "7000400210000",
                        "parent": "7000400000000",
                        "label": "园林绿化施工",
                        "children": []
                    },
                    {
                        "value": "7000400220000",
                        "parent": "7000400000000",
                        "label": "智能大厦/布线/弱电/安防",
                        "children": []
                    },
                    {
                        "value": "7000400230000",
                        "parent": "7000400000000",
                        "label": "中央空调安装工",
                        "children": []
                    }
                ]
            },
            {
                "value": "7000200000000",
                "parent": "7000000000000",
                "label": "工程管理",
                "children": [
                    {
                        "value": "7000200010000",
                        "parent": "7000200000000",
                        "label": "报价工程师",
                        "children": []
                    },
                    {
                        "value": "7000200020000",
                        "parent": "7000200000000",
                        "label": "房地产策划",
                        "children": []
                    },
                    {
                        "value": "7000200040000",
                        "parent": "7000200000000",
                        "label": "房地产项目",
                        "children": []
                    },
                    {
                        "value": "7000200050000",
                        "parent": "7000200000000",
                        "label": "房地产项目开发报建",
                        "children": []
                    },
                    {
                        "value": "7000200060000",
                        "parent": "7000200000000",
                        "label": "房地产项目配套工程师",
                        "children": []
                    },
                    {
                        "value": "7000200070000",
                        "parent": "7000200000000",
                        "label": "高级建筑工程师/总工",
                        "children": []
                    },
                    {
                        "value": "7000200080000",
                        "parent": "7000200000000",
                        "label": "工程监察",
                        "children": []
                    },
                    {
                        "value": "7000200090000",
                        "parent": "7000200000000",
                        "label": "工程监理",
                        "children": []
                    },
                    {
                        "value": "7000200100000",
                        "parent": "7000200000000",
                        "label": "工程经理",
                        "children": []
                    },
                    {
                        "value": "7000200110000",
                        "parent": "7000200000000",
                        "label": "工程造价/预结算",
                        "children": []
                    },
                    {
                        "value": "7000200120000",
                        "parent": "7000200000000",
                        "label": "工程资料管理",
                        "children": []
                    },
                    {
                        "value": "7000200130000",
                        "parent": "7000200000000",
                        "label": "工程总监",
                        "children": []
                    },
                    {
                        "value": "7000200140000",
                        "parent": "7000200000000",
                        "label": "监理工程师",
                        "children": []
                    },
                    {
                        "value": "7000200150000",
                        "parent": "7000200000000",
                        "label": "建筑施工现场管理",
                        "children": []
                    },
                    {
                        "value": "7000200160000",
                        "parent": "7000200000000",
                        "label": "能源/矿产项目",
                        "children": []
                    },
                    {
                        "value": "7000200170000",
                        "parent": "7000200000000",
                        "label": "造价员",
                        "children": []
                    }
                ]
            },
            {
                "value": "7000300000000",
                "parent": "7000000000000",
                "label": "工程开发技术人员",
                "children": [
                    {
                        "value": "7000300010000",
                        "parent": "7000300000000",
                        "label": "安装工程师",
                        "children": []
                    },
                    {
                        "value": "7000300020000",
                        "parent": "7000300000000",
                        "label": "道路/桥梁/隧道工程技术",
                        "children": []
                    },
                    {
                        "value": "7000300030000",
                        "parent": "7000300000000",
                        "label": "地铁轨道设计",
                        "children": []
                    },
                    {
                        "value": "7000300040000",
                        "parent": "7000300000000",
                        "label": "地质工程师",
                        "children": []
                    },
                    {
                        "value": "7000300050000",
                        "parent": "7000300000000",
                        "label": "电力电子研发工程师",
                        "children": []
                    },
                    {
                        "value": "7000300060000",
                        "parent": "7000300000000",
                        "label": "电力工程师",
                        "children": []
                    },
                    {
                        "value": "7000300070000",
                        "parent": "7000300000000",
                        "label": "电力系统研发工程师",
                        "children": []
                    },
                    {
                        "value": "7000300080000",
                        "parent": "7000300000000",
                        "label": "废气处理工程师",
                        "children": []
                    },
                    {
                        "value": "7000300090000",
                        "parent": "7000300000000",
                        "label": "给排水工程",
                        "children": []
                    },
                    {
                        "value": "7000300100000",
                        "parent": "7000300000000",
                        "label": "工程设计工程师",
                        "children": []
                    },
                    {
                        "value": "7000300110000",
                        "parent": "7000300000000",
                        "label": "工程资料员",
                        "children": []
                    },
                    {
                        "value": "7000300120000",
                        "parent": "7000300000000",
                        "label": "固废处理工程师",
                        "children": []
                    },
                    {
                        "value": "7000300130000",
                        "parent": "7000300000000",
                        "label": "光源/照明工程师",
                        "children": []
                    },
                    {
                        "value": "7000300140000",
                        "parent": "7000300000000",
                        "label": "轨道交通工程师/技术员",
                        "children": []
                    },
                    {
                        "value": "7000300150000",
                        "parent": "7000300000000",
                        "label": "核力/火力工程师",
                        "children": []
                    },
                    {
                        "value": "7000300160000",
                        "parent": "7000300000000",
                        "label": "环保工程师",
                        "children": []
                    },
                    {
                        "value": "7000300170000",
                        "parent": "7000300000000",
                        "label": "环保技术工程师",
                        "children": []
                    },
                    {
                        "value": "7000300180000",
                        "parent": "7000300000000",
                        "label": "环境管理/园林景区保护",
                        "children": []
                    },
                    {
                        "value": "7000300190000",
                        "parent": "7000300000000",
                        "label": "环评技术员",
                        "children": []
                    },
                    {
                        "value": "7000300200000",
                        "parent": "7000300000000",
                        "label": "绘图员",
                        "children": []
                    },
                    {
                        "value": "7000300210000",
                        "parent": "7000300000000",
                        "label": "机电建造师",
                        "children": []
                    },
                    {
                        "value": "7000300220000",
                        "parent": "7000300000000",
                        "label": "架线和管道工程技术",
                        "children": []
                    },
                    {
                        "value": "7000300230000",
                        "parent": "7000300000000",
                        "label": "建筑工程测绘/测量",
                        "children": []
                    },
                    {
                        "value": "7000300240000",
                        "parent": "7000300000000",
                        "label": "建筑设计师",
                        "children": []
                    },
                    {
                        "value": "7000300250000",
                        "parent": "7000300000000",
                        "label": "结构工程师",
                        "children": []
                    },
                    {
                        "value": "7000300260000",
                        "parent": "7000300000000",
                        "label": "结构设计师",
                        "children": []
                    },
                    {
                        "value": "7000300270000",
                        "parent": "7000300000000",
                        "label": "勘探工程师",
                        "children": []
                    },
                    {
                        "value": "7000300280000",
                        "parent": "7000300000000",
                        "label": "空间设计师",
                        "children": []
                    },
                    {
                        "value": "7000300290000",
                        "parent": "7000300000000",
                        "label": "空调工程师",
                        "children": []
                    },
                    {
                        "value": "7000300300000",
                        "parent": "7000300000000",
                        "label": "控制保护研发工程师",
                        "children": []
                    },
                    {
                        "value": "7000300310000",
                        "parent": "7000300000000",
                        "label": "内业技术员",
                        "children": []
                    },
                    {
                        "value": "7000300320000",
                        "parent": "7000300000000",
                        "label": "暖通工程师",
                        "children": []
                    },
                    {
                        "value": "7000300330000",
                        "parent": "7000300000000",
                        "label": "配电设计",
                        "children": []
                    },
                    {
                        "value": "7000300340000",
                        "parent": "7000300000000",
                        "label": "桥梁工程师",
                        "children": []
                    },
                    {
                        "value": "7000300350000",
                        "parent": "7000300000000",
                        "label": "弱电工程师",
                        "children": []
                    },
                    {
                        "value": "7000300360000",
                        "parent": "7000300000000",
                        "label": "生态治理/规划",
                        "children": []
                    },
                    {
                        "value": "7000300370000",
                        "parent": "7000300000000",
                        "label": "石油工程师",
                        "children": []
                    },
                    {
                        "value": "7000300380000",
                        "parent": "7000300000000",
                        "label": "市政工程",
                        "children": []
                    },
                    {
                        "value": "7000300390000",
                        "parent": "7000300000000",
                        "label": "水处理工程师",
                        "children": []
                    },
                    {
                        "value": "7000300400000",
                        "parent": "7000300000000",
                        "label": "水电安装工程师",
                        "children": []
                    },
                    {
                        "value": "7000300410000",
                        "parent": "7000300000000",
                        "label": "水利/港口工程技术",
                        "children": []
                    },
                    {
                        "value": "7000300420000",
                        "parent": "7000300000000",
                        "label": "水利/水电工程师",
                        "children": []
                    },
                    {
                        "value": "7000300430000",
                        "parent": "7000300000000",
                        "label": "隧道工程师",
                        "children": []
                    },
                    {
                        "value": "7000300440000",
                        "parent": "7000300000000",
                        "label": "天然气技术人员",
                        "children": []
                    },
                    {
                        "value": "7000300450000",
                        "parent": "7000300000000",
                        "label": "土建勘察",
                        "children": []
                    },
                    {
                        "value": "7000300460000",
                        "parent": "7000300000000",
                        "label": "土木/土建/结构工程师",
                        "children": []
                    },
                    {
                        "value": "7000300470000",
                        "parent": "7000300000000",
                        "label": "项目申报专员",
                        "children": []
                    },
                    {
                        "value": "7000300480000",
                        "parent": "7000300000000",
                        "label": "选矿/采矿",
                        "children": []
                    },
                    {
                        "value": "7000300490000",
                        "parent": "7000300000000",
                        "label": "岩土工程",
                        "children": []
                    },
                    {
                        "value": "7000300500000",
                        "parent": "7000300000000",
                        "label": "装修工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "7000100000000",
                "parent": "7000000000000",
                "label": "工程安全/工程质检",
                "children": [
                    {
                        "value": "7000100010000",
                        "parent": "7000100000000",
                        "label": "安防",
                        "children": []
                    },
                    {
                        "value": "7000100020000",
                        "parent": "7000100000000",
                        "label": "安全管理",
                        "children": []
                    },
                    {
                        "value": "7000100030000",
                        "parent": "7000100000000",
                        "label": "安全消防",
                        "children": []
                    },
                    {
                        "value": "7000100040000",
                        "parent": "7000100000000",
                        "label": "安全主管",
                        "children": []
                    },
                    {
                        "value": "7000100050000",
                        "parent": "7000100000000",
                        "label": "工程质量管理",
                        "children": []
                    },
                    {
                        "value": "7000100060000",
                        "parent": "7000100000000",
                        "label": "化验员质检员",
                        "children": []
                    },
                    {
                        "value": "7000100070000",
                        "parent": "7000100000000",
                        "label": "环境/健康/安全工程师",
                        "children": []
                    },
                    {
                        "value": "7000100080000",
                        "parent": "7000100000000",
                        "label": "环境/健康/安全经理",
                        "children": []
                    },
                    {
                        "value": "7000100090000",
                        "parent": "7000100000000",
                        "label": "环境监测工程师",
                        "children": []
                    },
                    {
                        "value": "7000100100000",
                        "parent": "7000100000000",
                        "label": "环境评价工程师",
                        "children": []
                    },
                    {
                        "value": "7000100110000",
                        "parent": "7000100000000",
                        "label": "建筑工程安全管理",
                        "children": []
                    },
                    {
                        "value": "7000100120000",
                        "parent": "7000100000000",
                        "label": "施工安全员",
                        "children": []
                    },
                    {
                        "value": "7000100130000",
                        "parent": "7000100000000",
                        "label": "消防工程师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "3000000000000",
        "parent": '',
        "label": "产品/项目/高级管理",
        "children": [
            {
                "value": "3000200000000",
                "parent": "3000000000000",
                "label": "高级管理",
                "children": [
                    {
                        "value": "3000200020000",
                        "parent": "3000200000000",
                        "label": "CEO/总裁/总经理",
                        "children": []
                    },
                    {
                        "value": "3000200030000",
                        "parent": "3000200000000",
                        "label": "CFO",
                        "children": []
                    },
                    {
                        "value": "3000200040000",
                        "parent": "3000200000000",
                        "label": "CIO",
                        "children": []
                    },
                    {
                        "value": "3000200050000",
                        "parent": "3000200000000",
                        "label": "CMO",
                        "children": []
                    },
                    {
                        "value": "3000200060000",
                        "parent": "3000200000000",
                        "label": "COO",
                        "children": []
                    },
                    {
                        "value": "3000200070000",
                        "parent": "3000200000000",
                        "label": "CTO",
                        "children": []
                    },
                    {
                        "value": "3000200080000",
                        "parent": "3000200000000",
                        "label": "办事处首席代表",
                        "children": []
                    },
                    {
                        "value": "3000200120000",
                        "parent": "3000200000000",
                        "label": "创始人",
                        "children": []
                    },
                    {
                        "value": "3000200130000",
                        "parent": "3000200000000",
                        "label": "分公司/代表处负责人",
                        "children": []
                    },
                    {
                        "value": "3000200140000",
                        "parent": "3000200000000",
                        "label": "副总裁/VP",
                        "children": []
                    },
                    {
                        "value": "3000200150000",
                        "parent": "3000200000000",
                        "label": "高级管理职位",
                        "children": []
                    },
                    {
                        "value": "3000200160000",
                        "parent": "3000200000000",
                        "label": "工厂厂长/副厂长",
                        "children": []
                    },
                    {
                        "value": "3000200170000",
                        "parent": "3000200000000",
                        "label": "行长/副行长",
                        "children": []
                    },
                    {
                        "value": "3000200180000",
                        "parent": "3000200000000",
                        "label": "合伙人/投资合伙人",
                        "children": []
                    },
                    {
                        "value": "3000200190000",
                        "parent": "3000200000000",
                        "label": "企业秘书/董事会秘书",
                        "children": []
                    },
                    {
                        "value": "3000200090000",
                        "parent": "3000200000000",
                        "label": "事业部管理",
                        "children": []
                    },
                    {
                        "value": "3000200230000",
                        "parent": "3000200000000",
                        "label": "总编/副总编",
                        "children": []
                    },
                    {
                        "value": "3000200240000",
                        "parent": "3000200000000",
                        "label": "总裁助理/总经理助理",
                        "children": []
                    },
                    {
                        "value": "3000200250000",
                        "parent": "3000200000000",
                        "label": "总工程师/副总工程师",
                        "children": []
                    },
                    {
                        "value": "3000200010000",
                        "parent": "3000200000000",
                        "label": "4S店管理",
                        "children": []
                    }
                ]
            },
            {
                "value": "3000100000000",
                "parent": "3000000000000",
                "label": "产品经理",
                "children": [
                    {
                        "value": "3000100010000",
                        "parent": "3000100000000",
                        "label": "安全产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100020000",
                        "parent": "3000100000000",
                        "label": "策略产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100030000",
                        "parent": "3000100000000",
                        "label": "产品架构师",
                        "children": []
                    },
                    {
                        "value": "3000100040000",
                        "parent": "3000100000000",
                        "label": "产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100060000",
                        "parent": "3000100000000",
                        "label": "产品主管",
                        "children": []
                    },
                    {
                        "value": "3000100050000",
                        "parent": "3000100000000",
                        "label": "产品专员",
                        "children": []
                    },
                    {
                        "value": "3000100070000",
                        "parent": "3000100000000",
                        "label": "产品总监",
                        "children": []
                    },
                    {
                        "value": "3000100080000",
                        "parent": "3000100000000",
                        "label": "电商产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100090000",
                        "parent": "3000100000000",
                        "label": "供应链产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100100000",
                        "parent": "3000100000000",
                        "label": "互联网产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100110000",
                        "parent": "3000100000000",
                        "label": "软件产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100120000",
                        "parent": "3000100000000",
                        "label": "商业化产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100130000",
                        "parent": "3000100000000",
                        "label": "市场产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100140000",
                        "parent": "3000100000000",
                        "label": "数据产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100150000",
                        "parent": "3000100000000",
                        "label": "网页产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100160000",
                        "parent": "3000100000000",
                        "label": "业务增长产品经理",
                        "children": []
                    },
                    {
                        "value": "3000100170000",
                        "parent": "3000100000000",
                        "label": "移动产品经理",
                        "children": []
                    }
                ]
            },
            {
                "value": "3000300000000",
                "parent": "3000000000000",
                "label": "项目管理",
                "children": [
                    {
                        "value": "3000300010000",
                        "parent": "3000300000000",
                        "label": "IT项目经理",
                        "children": []
                    },
                    {
                        "value": "3000300020000",
                        "parent": "3000300000000",
                        "label": "IT项目执行",
                        "children": []
                    },
                    {
                        "value": "3000300030000",
                        "parent": "3000300000000",
                        "label": "IT项目总监",
                        "children": []
                    },
                    {
                        "value": "3000300040000",
                        "parent": "3000300000000",
                        "label": "电子/电器项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300050000",
                        "parent": "3000300000000",
                        "label": "服装/纺织/皮革项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300060000",
                        "parent": "3000300000000",
                        "label": "广告/会展项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300180000",
                        "parent": "3000300000000",
                        "label": "化工项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300070000",
                        "parent": "3000300000000",
                        "label": "汽车工程项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300080000",
                        "parent": "3000300000000",
                        "label": "生产项目经理/主管",
                        "children": []
                    },
                    {
                        "value": "3000300090000",
                        "parent": "3000300000000",
                        "label": "通信项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300100000",
                        "parent": "3000300000000",
                        "label": "物流/仓储项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300110000",
                        "parent": "3000300000000",
                        "label": "项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300120000",
                        "parent": "3000300000000",
                        "label": "项目经理",
                        "children": []
                    },
                    {
                        "value": "3000300130000",
                        "parent": "3000300000000",
                        "label": "项目执行",
                        "children": []
                    },
                    {
                        "value": "3000300140000",
                        "parent": "3000300000000",
                        "label": "项目主管",
                        "children": []
                    },
                    {
                        "value": "3000300150000",
                        "parent": "3000300000000",
                        "label": "项目助理",
                        "children": []
                    },
                    {
                        "value": "3000300160000",
                        "parent": "3000300000000",
                        "label": "项目专员",
                        "children": []
                    },
                    {
                        "value": "3000300170000",
                        "parent": "3000300000000",
                        "label": "项目总监",
                        "children": []
                    },
                    {
                        "value": "3000300190000",
                        "parent": "3000300000000",
                        "label": "医药项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300200000",
                        "parent": "3000300000000",
                        "label": "证券/投资项目管理",
                        "children": []
                    },
                    {
                        "value": "3000300210000",
                        "parent": "3000300000000",
                        "label": "咨询项目管理",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "11000000000000",
        "parent": '',
        "label": "教育/培训",
        "children": [
            {
                "value": "11000300000000",
                "parent": "11000000000000",
                "label": "教务管理",
                "children": [
                    {
                        "value": "11000300010000",
                        "parent": "11000300000000",
                        "label": "班主任/教师助理",
                        "children": []
                    },
                    {
                        "value": "11000300020000",
                        "parent": "11000300000000",
                        "label": "辅导员",
                        "children": []
                    },
                    {
                        "value": "11000300030000",
                        "parent": "11000300000000",
                        "label": "教务专员",
                        "children": []
                    },
                    {
                        "value": "11000300040000",
                        "parent": "11000300000000",
                        "label": "教学/教务管理",
                        "children": []
                    },
                    {
                        "value": "11000300050000",
                        "parent": "11000300000000",
                        "label": "教育产品开发",
                        "children": []
                    },
                    {
                        "value": "11000300060000",
                        "parent": "11000300000000",
                        "label": "课程设计",
                        "children": []
                    },
                    {
                        "value": "11000300070000",
                        "parent": "11000300000000",
                        "label": "培训策划",
                        "children": []
                    },
                    {
                        "value": "11000300080000",
                        "parent": "11000300000000",
                        "label": "培训督导",
                        "children": []
                    },
                    {
                        "value": "11000300090000",
                        "parent": "11000300000000",
                        "label": "培训主管",
                        "children": []
                    },
                    {
                        "value": "11000300100000",
                        "parent": "11000300000000",
                        "label": "校区主任",
                        "children": []
                    },
                    {
                        "value": "11000300110000",
                        "parent": "11000300000000",
                        "label": "校长/副校长",
                        "children": []
                    },
                    {
                        "value": "11000300120000",
                        "parent": "11000300000000",
                        "label": "学习管理师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11001000000000",
                "parent": "11000000000000",
                "label": "中小学课程辅导",
                "children": [
                    {
                        "value": "11001000010000",
                        "parent": "11001000000000",
                        "label": "初中教师",
                        "children": []
                    },
                    {
                        "value": "11001000020000",
                        "parent": "11001000000000",
                        "label": "高中教师",
                        "children": []
                    },
                    {
                        "value": "11001000030000",
                        "parent": "11001000000000",
                        "label": "家教",
                        "children": []
                    },
                    {
                        "value": "11001000040000",
                        "parent": "11001000000000",
                        "label": "兼职教师",
                        "children": []
                    },
                    {
                        "value": "11001000050000",
                        "parent": "11001000000000",
                        "label": "理科教师",
                        "children": []
                    },
                    {
                        "value": "11001000060000",
                        "parent": "11001000000000",
                        "label": "文科教师",
                        "children": []
                    },
                    {
                        "value": "11001000070000",
                        "parent": "11001000000000",
                        "label": "小学教师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000800000000",
                "parent": "11000000000000",
                "label": "早教/幼教",
                "children": [
                    {
                        "value": "11000800010000",
                        "parent": "11000800000000",
                        "label": "保育员",
                        "children": []
                    },
                    {
                        "value": "11000800020000",
                        "parent": "11000800000000",
                        "label": "儿童教育老师",
                        "children": []
                    },
                    {
                        "value": "11000800030000",
                        "parent": "11000800000000",
                        "label": "绘本老师",
                        "children": []
                    },
                    {
                        "value": "11000800040000",
                        "parent": "11000800000000",
                        "label": "亲子老师",
                        "children": []
                    },
                    {
                        "value": "11000800050000",
                        "parent": "11000800000000",
                        "label": "学前教育老师",
                        "children": []
                    },
                    {
                        "value": "11000800060000",
                        "parent": "11000800000000",
                        "label": "幼儿启蒙老师",
                        "children": []
                    },
                    {
                        "value": "11000800070000",
                        "parent": "11000800000000",
                        "label": "幼儿园老师",
                        "children": []
                    },
                    {
                        "value": "11000800080000",
                        "parent": "11000800000000",
                        "label": "幼教/早教",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000200000000",
                "parent": "11000000000000",
                "label": "才艺特长培训",
                "children": [
                    {
                        "value": "11000200010000",
                        "parent": "11000200000000",
                        "label": "表演老师",
                        "children": []
                    },
                    {
                        "value": "11000200020000",
                        "parent": "11000200000000",
                        "label": "高尔夫教练",
                        "children": []
                    },
                    {
                        "value": "11000200030000",
                        "parent": "11000200000000",
                        "label": "绘画老师",
                        "children": []
                    },
                    {
                        "value": "11000200040000",
                        "parent": "11000200000000",
                        "label": "机器人编程老师",
                        "children": []
                    },
                    {
                        "value": "11000200050000",
                        "parent": "11000200000000",
                        "label": "驾驶教练",
                        "children": []
                    },
                    {
                        "value": "11000200060000",
                        "parent": "11000200000000",
                        "label": "健身教练",
                        "children": []
                    },
                    {
                        "value": "11000200070000",
                        "parent": "11000200000000",
                        "label": "乐器老师",
                        "children": []
                    },
                    {
                        "value": "11000200080000",
                        "parent": "11000200000000",
                        "label": "美术教师",
                        "children": []
                    },
                    {
                        "value": "11000200090000",
                        "parent": "11000200000000",
                        "label": "球类运动教练",
                        "children": []
                    },
                    {
                        "value": "11000200100000",
                        "parent": "11000200000000",
                        "label": "声乐老师",
                        "children": []
                    },
                    {
                        "value": "11000200110000",
                        "parent": "11000200000000",
                        "label": "书法老师",
                        "children": []
                    },
                    {
                        "value": "11000200120000",
                        "parent": "11000200000000",
                        "label": "跆拳道教练",
                        "children": []
                    },
                    {
                        "value": "11000200130000",
                        "parent": "11000200000000",
                        "label": "体育老师",
                        "children": []
                    },
                    {
                        "value": "11000200140000",
                        "parent": "11000200000000",
                        "label": "舞蹈教练",
                        "children": []
                    },
                    {
                        "value": "11000200150000",
                        "parent": "11000200000000",
                        "label": "游泳教练",
                        "children": []
                    },
                    {
                        "value": "11000200160000",
                        "parent": "11000200000000",
                        "label": "瑜伽教练",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000900000000",
                "parent": "11000000000000",
                "label": "职业培训",
                "children": [
                    {
                        "value": "11000900010000",
                        "parent": "11000900000000",
                        "label": "HR培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000900020000",
                        "parent": "11000900000000",
                        "label": "财会培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000900030000",
                        "parent": "11000900000000",
                        "label": "动漫培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000900040000",
                        "parent": "11000900000000",
                        "label": "法律培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000900050000",
                        "parent": "11000900000000",
                        "label": "美发培训师",
                        "children": []
                    },
                    {
                        "value": "11000900060000",
                        "parent": "11000900000000",
                        "label": "美容导师",
                        "children": []
                    },
                    {
                        "value": "11000900070000",
                        "parent": "11000900000000",
                        "label": "培训师/讲师",
                        "children": []
                    },
                    {
                        "value": "11000900080000",
                        "parent": "11000900000000",
                        "label": "职业技术教师",
                        "children": []
                    },
                    {
                        "value": "11000900090000",
                        "parent": "11000900000000",
                        "label": "专升本讲师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000700000000",
                "parent": "11000000000000",
                "label": "语言培训",
                "children": [
                    {
                        "value": "11000700010000",
                        "parent": "11000700000000",
                        "label": "德语老师",
                        "children": []
                    },
                    {
                        "value": "11000700020000",
                        "parent": "11000700000000",
                        "label": "韩语老师",
                        "children": []
                    },
                    {
                        "value": "11000700030000",
                        "parent": "11000700000000",
                        "label": "汉语老师",
                        "children": []
                    },
                    {
                        "value": "11000700040000",
                        "parent": "11000700000000",
                        "label": "日语老师",
                        "children": []
                    },
                    {
                        "value": "11000700050000",
                        "parent": "11000700000000",
                        "label": "少儿英语老师",
                        "children": []
                    },
                    {
                        "value": "11000700060000",
                        "parent": "11000700000000",
                        "label": "外籍教师",
                        "children": []
                    },
                    {
                        "value": "11000700070000",
                        "parent": "11000700000000",
                        "label": "外语教师",
                        "children": []
                    },
                    {
                        "value": "11000700080000",
                        "parent": "11000700000000",
                        "label": "英语老师",
                        "children": []
                    },
                    {
                        "value": "11000700090000",
                        "parent": "11000700000000",
                        "label": "中文老师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000500000000",
                "parent": "11000000000000",
                "label": "留学辅导",
                "children": [
                    {
                        "value": "11000500010000",
                        "parent": "11000500000000",
                        "label": "SAT教师",
                        "children": []
                    },
                    {
                        "value": "11000500020000",
                        "parent": "11000500000000",
                        "label": "出国留学考试培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000500030000",
                        "parent": "11000500000000",
                        "label": "托福教师",
                        "children": []
                    },
                    {
                        "value": "11000500040000",
                        "parent": "11000500000000",
                        "label": "雅思英语老师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000100000000",
                "parent": "11000000000000",
                "label": "IT培训",
                "children": [
                    {
                        "value": "11000100010000",
                        "parent": "11000100000000",
                        "label": ".NET培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100020000",
                        "parent": "11000100000000",
                        "label": "Android培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100030000",
                        "parent": "11000100000000",
                        "label": "C++培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100040000",
                        "parent": "11000100000000",
                        "label": "iOS培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100050000",
                        "parent": "11000100000000",
                        "label": "IT培训",
                        "children": []
                    },
                    {
                        "value": "11000100060000",
                        "parent": "11000100000000",
                        "label": "JAVA培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100070000",
                        "parent": "11000100000000",
                        "label": "PHP培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100080000",
                        "parent": "11000100000000",
                        "label": "UI设计培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100090000",
                        "parent": "11000100000000",
                        "label": "Unity 3D培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100100000",
                        "parent": "11000100000000",
                        "label": "web前端培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100110000",
                        "parent": "11000100000000",
                        "label": "编程老师",
                        "children": []
                    },
                    {
                        "value": "11000100120000",
                        "parent": "11000100000000",
                        "label": "大数据讲师",
                        "children": []
                    },
                    {
                        "value": "11000100130000",
                        "parent": "11000100000000",
                        "label": "机器学习讲师",
                        "children": []
                    },
                    {
                        "value": "11000100140000",
                        "parent": "11000100000000",
                        "label": "人工智能讲师",
                        "children": []
                    },
                    {
                        "value": "11000100150000",
                        "parent": "11000100000000",
                        "label": "软件测试培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000100160000",
                        "parent": "11000100000000",
                        "label": "云计算讲师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000600000000",
                "parent": "11000000000000",
                "label": "特殊教育",
                "children": [
                    {
                        "value": "11000600010000",
                        "parent": "11000600000000",
                        "label": "感统教师",
                        "children": []
                    },
                    {
                        "value": "11000600020000",
                        "parent": "11000600000000",
                        "label": "康复训练老师",
                        "children": []
                    },
                    {
                        "value": "11000600030000",
                        "parent": "11000600000000",
                        "label": "特教老师",
                        "children": []
                    },
                    {
                        "value": "11000600040000",
                        "parent": "11000600000000",
                        "label": "学能感统教师",
                        "children": []
                    }
                ]
            },
            {
                "value": "11000400000000",
                "parent": "11000000000000",
                "label": "考研辅导",
                "children": [
                    {
                        "value": "11000400010000",
                        "parent": "11000400000000",
                        "label": "考研培训讲师",
                        "children": []
                    },
                    {
                        "value": "11000400020000",
                        "parent": "11000400000000",
                        "label": "考研英语老师",
                        "children": []
                    },
                    {
                        "value": "11000400030000",
                        "parent": "11000400000000",
                        "label": "考研专业课讲师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "4000000000000",
        "parent": '',
        "label": "场务/演艺/影视",
        "children": [
            {
                "value": "4000200000000",
                "parent": "4000000000000",
                "label": "演艺人员/经纪人",
                "children": [
                    {
                        "value": "4000200010000",
                        "parent": "4000200000000",
                        "label": "经纪人",
                        "children": []
                    },
                    {
                        "value": "4000200020000",
                        "parent": "4000200000000",
                        "label": "配音",
                        "children": []
                    },
                    {
                        "value": "4000200030000",
                        "parent": "4000200000000",
                        "label": "星探",
                        "children": []
                    },
                    {
                        "value": "4000200040000",
                        "parent": "4000200000000",
                        "label": "演员/模特",
                        "children": []
                    },
                    {
                        "value": "4000200050000",
                        "parent": "4000200000000",
                        "label": "主播",
                        "children": []
                    },
                    {
                        "value": "4000200060000",
                        "parent": "4000200000000",
                        "label": "主持人/DJ",
                        "children": []
                    }
                ]
            },
            {
                "value": "4000300000000",
                "parent": "4000000000000",
                "label": "影视制作",
                "children": [
                    {
                        "value": "4000300010000",
                        "parent": "4000300000000",
                        "label": "编导",
                        "children": []
                    },
                    {
                        "value": "4000300020000",
                        "parent": "4000300000000",
                        "label": "编剧",
                        "children": []
                    },
                    {
                        "value": "4000300030000",
                        "parent": "4000300000000",
                        "label": "导演",
                        "children": []
                    },
                    {
                        "value": "4000300040000",
                        "parent": "4000300000000",
                        "label": "后期/剪辑/特效",
                        "children": []
                    },
                    {
                        "value": "4000300050000",
                        "parent": "4000300000000",
                        "label": "录音/音效",
                        "children": []
                    },
                    {
                        "value": "4000300060000",
                        "parent": "4000300000000",
                        "label": "美术指导",
                        "children": []
                    },
                    {
                        "value": "4000300070000",
                        "parent": "4000300000000",
                        "label": "摄影/摄像",
                        "children": []
                    },
                    {
                        "value": "4000300080000",
                        "parent": "4000300000000",
                        "label": "视频编辑",
                        "children": []
                    },
                    {
                        "value": "4000300090000",
                        "parent": "4000300000000",
                        "label": "统筹制片人",
                        "children": []
                    },
                    {
                        "value": "4000300100000",
                        "parent": "4000300000000",
                        "label": "音频编辑",
                        "children": []
                    },
                    {
                        "value": "4000300110000",
                        "parent": "4000300000000",
                        "label": "影视策划",
                        "children": []
                    },
                    {
                        "value": "4000300120000",
                        "parent": "4000300000000",
                        "label": "影视制作",
                        "children": []
                    },
                    {
                        "value": "4000300130000",
                        "parent": "4000300000000",
                        "label": "执行制片人",
                        "children": []
                    },
                    {
                        "value": "4000300140000",
                        "parent": "4000300000000",
                        "label": "制片人",
                        "children": []
                    }
                ]
            },
            {
                "value": "4000100000000",
                "parent": "4000000000000",
                "label": "场务/剧务",
                "children": [
                    {
                        "value": "4000100010000",
                        "parent": "4000100000000",
                        "label": "导演助理",
                        "children": []
                    },
                    {
                        "value": "4000100020000",
                        "parent": "4000100000000",
                        "label": "放映管理",
                        "children": []
                    },
                    {
                        "value": "4000100030000",
                        "parent": "4000100000000",
                        "label": "放映员",
                        "children": []
                    },
                    {
                        "value": "4000100040000",
                        "parent": "4000100000000",
                        "label": "化妆助理",
                        "children": []
                    },
                    {
                        "value": "4000100050000",
                        "parent": "4000100000000",
                        "label": "剧务",
                        "children": []
                    },
                    {
                        "value": "4000100060000",
                        "parent": "4000100000000",
                        "label": "群演/跟组演员",
                        "children": []
                    },
                    {
                        "value": "4000100070000",
                        "parent": "4000100000000",
                        "label": "摄影助理",
                        "children": []
                    },
                    {
                        "value": "4000100080000",
                        "parent": "4000100000000",
                        "label": "艺人助理",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "20000000000000",
        "parent": '',
        "label": "运维/测试",
        "children": [
            {
                "value": "20000200000000",
                "parent": "20000000000000",
                "label": "运维支持",
                "children": [
                    {
                        "value": "20000200010000",
                        "parent": "20000200000000",
                        "label": "DBA",
                        "children": []
                    },
                    {
                        "value": "20000200020000",
                        "parent": "20000200000000",
                        "label": "ERP实施顾问",
                        "children": []
                    },
                    {
                        "value": "20000200030000",
                        "parent": "20000200000000",
                        "label": "FAE",
                        "children": []
                    },
                    {
                        "value": "20000200040000",
                        "parent": "20000200000000",
                        "label": "Helpdesk",
                        "children": []
                    },
                    {
                        "value": "20000200050000",
                        "parent": "20000200000000",
                        "label": "IT工程师",
                        "children": []
                    },
                    {
                        "value": "20000200060000",
                        "parent": "20000200000000",
                        "label": "IT技术支持/维护工程师",
                        "children": []
                    },
                    {
                        "value": "20000200070000",
                        "parent": "20000200000000",
                        "label": "IT文档工程师",
                        "children": []
                    },
                    {
                        "value": "20000200080000",
                        "parent": "20000200000000",
                        "label": "IT质量管理工程师",
                        "children": []
                    },
                    {
                        "value": "20000200090000",
                        "parent": "20000200000000",
                        "label": "IT质量管理经理/主管",
                        "children": []
                    },
                    {
                        "value": "20000200100000",
                        "parent": "20000200000000",
                        "label": "标准化工程师",
                        "children": []
                    },
                    {
                        "value": "20000200110000",
                        "parent": "20000200000000",
                        "label": "船舶维修/保养",
                        "children": []
                    },
                    {
                        "value": "20000200120000",
                        "parent": "20000200000000",
                        "label": "电子/电器设备工程师",
                        "children": []
                    },
                    {
                        "value": "20000200130000",
                        "parent": "20000200000000",
                        "label": "飞机维修/保养",
                        "children": []
                    },
                    {
                        "value": "20000200140000",
                        "parent": "20000200000000",
                        "label": "机械维修/保养",
                        "children": []
                    },
                    {
                        "value": "20000200150000",
                        "parent": "20000200000000",
                        "label": "计算机硬件维护工程师",
                        "children": []
                    },
                    {
                        "value": "20000200160000",
                        "parent": "20000200000000",
                        "label": "列车维修/保养",
                        "children": []
                    },
                    {
                        "value": "20000200170000",
                        "parent": "20000200000000",
                        "label": "设备维护工程师",
                        "children": []
                    },
                    {
                        "value": "20000200180000",
                        "parent": "20000200000000",
                        "label": "数据库管理员",
                        "children": []
                    },
                    {
                        "value": "20000200190000",
                        "parent": "20000200000000",
                        "label": "网络工程师",
                        "children": []
                    },
                    {
                        "value": "20000200200000",
                        "parent": "20000200000000",
                        "label": "网络管理员",
                        "children": []
                    },
                    {
                        "value": "20000200210000",
                        "parent": "20000200000000",
                        "label": "网络与信息安全工程师",
                        "children": []
                    },
                    {
                        "value": "20000200220000",
                        "parent": "20000200000000",
                        "label": "网络运维",
                        "children": []
                    },
                    {
                        "value": "20000200230000",
                        "parent": "20000200000000",
                        "label": "网优工程师",
                        "children": []
                    },
                    {
                        "value": "20000200240000",
                        "parent": "20000200000000",
                        "label": "维护工程师/维护经理",
                        "children": []
                    },
                    {
                        "value": "20000200250000",
                        "parent": "20000200000000",
                        "label": "系统管理员",
                        "children": []
                    },
                    {
                        "value": "20000200260000",
                        "parent": "20000200000000",
                        "label": "系统运维",
                        "children": []
                    },
                    {
                        "value": "20000200270000",
                        "parent": "20000200000000",
                        "label": "现场应用工程师（FAE）",
                        "children": []
                    },
                    {
                        "value": "20000200280000",
                        "parent": "20000200000000",
                        "label": "信息技术标准化工程师",
                        "children": []
                    },
                    {
                        "value": "20000200290000",
                        "parent": "20000200000000",
                        "label": "信息技术经理/主管",
                        "children": []
                    },
                    {
                        "value": "20000200300000",
                        "parent": "20000200000000",
                        "label": "信息技术专员",
                        "children": []
                    },
                    {
                        "value": "20000200310000",
                        "parent": "20000200000000",
                        "label": "医疗器械维修/保养",
                        "children": []
                    },
                    {
                        "value": "20000200320000",
                        "parent": "20000200000000",
                        "label": "运维工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "20000100000000",
                "parent": "20000000000000",
                "label": "测试工程师",
                "children": [
                    {
                        "value": "20000100010000",
                        "parent": "20000100000000",
                        "label": "测试/可靠性工程师",
                        "children": []
                    },
                    {
                        "value": "20000100020000",
                        "parent": "20000100000000",
                        "label": "通信测试工程师",
                        "children": []
                    },
                    {
                        "value": "20000100030000",
                        "parent": "20000100000000",
                        "label": "测试开发",
                        "children": []
                    },
                    {
                        "value": "20000100040000",
                        "parent": "20000100000000",
                        "label": "电声/音响工程师/技术员",
                        "children": []
                    },
                    {
                        "value": "20000100050000",
                        "parent": "20000100000000",
                        "label": "功能测试",
                        "children": []
                    },
                    {
                        "value": "20000100060000",
                        "parent": "20000100000000",
                        "label": "软件测试",
                        "children": []
                    },
                    {
                        "value": "20000100070000",
                        "parent": "20000100000000",
                        "label": "无人机组装测试",
                        "children": []
                    },
                    {
                        "value": "20000100080000",
                        "parent": "20000100000000",
                        "label": "无损检测工程师",
                        "children": []
                    },
                    {
                        "value": "20000100090000",
                        "parent": "20000100000000",
                        "label": "系统测试",
                        "children": []
                    },
                    {
                        "value": "20000100100000",
                        "parent": "20000100000000",
                        "label": "协议测试",
                        "children": []
                    },
                    {
                        "value": "20000100110000",
                        "parent": "20000100000000",
                        "label": "性能测试",
                        "children": []
                    },
                    {
                        "value": "20000100120000",
                        "parent": "20000100000000",
                        "label": "移动端测试",
                        "children": []
                    },
                    {
                        "value": "20000100130000",
                        "parent": "20000100000000",
                        "label": "硬件测试",
                        "children": []
                    },
                    {
                        "value": "20000100140000",
                        "parent": "20000100000000",
                        "label": "游戏测试",
                        "children": []
                    },
                    {
                        "value": "20000100150000",
                        "parent": "20000100000000",
                        "label": "自动化测试工程师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "10000000000000",
        "parent": '',
        "label": "化工医药/机电研发",
        "children": [
            {
                "value": "10000400000000",
                "parent": "10000000000000",
                "label": "研究员/研究助理",
                "children": [
                    {
                        "value": "10000400010000",
                        "parent": "10000400000000",
                        "label": "安全研究",
                        "children": []
                    },
                    {
                        "value": "10000400020000",
                        "parent": "10000400000000",
                        "label": "大学教师",
                        "children": []
                    },
                    {
                        "value": "10000400030000",
                        "parent": "10000400000000",
                        "label": "大学教授",
                        "children": []
                    },
                    {
                        "value": "10000400040000",
                        "parent": "10000400000000",
                        "label": "科研人员",
                        "children": []
                    },
                    {
                        "value": "10000400050000",
                        "parent": "10000400000000",
                        "label": "实验室研究员/技术员",
                        "children": []
                    },
                    {
                        "value": "10000400060000",
                        "parent": "10000400000000",
                        "label": "研究助理",
                        "children": []
                    },
                    {
                        "value": "10000400070000",
                        "parent": "10000400000000",
                        "label": "作物育种",
                        "children": []
                    }
                ]
            },
            {
                "value": "10000100000000",
                "parent": "10000000000000",
                "label": "化工医药类研发",
                "children": [
                    {
                        "value": "10000100010000",
                        "parent": "10000100000000",
                        "label": "合成工程师",
                        "children": []
                    },
                    {
                        "value": "10000100020000",
                        "parent": "10000100000000",
                        "label": "化工研发",
                        "children": []
                    },
                    {
                        "value": "10000100030000",
                        "parent": "10000100000000",
                        "label": "化学/化工技术总监",
                        "children": []
                    },
                    {
                        "value": "10000100040000",
                        "parent": "10000100000000",
                        "label": "化学操作",
                        "children": []
                    },
                    {
                        "value": "10000100050000",
                        "parent": "10000100000000",
                        "label": "化学分析",
                        "children": []
                    },
                    {
                        "value": "10000100060000",
                        "parent": "10000100000000",
                        "label": "化学技术应用",
                        "children": []
                    },
                    {
                        "value": "10000100070000",
                        "parent": "10000100000000",
                        "label": "化学制剂研发",
                        "children": []
                    },
                    {
                        "value": "10000100080000",
                        "parent": "10000100000000",
                        "label": "化验/检验",
                        "children": []
                    },
                    {
                        "value": "10000100090000",
                        "parent": "10000100000000",
                        "label": "化妆品研发",
                        "children": []
                    },
                    {
                        "value": "10000100100000",
                        "parent": "10000100000000",
                        "label": "临床数据分析",
                        "children": []
                    },
                    {
                        "value": "10000100110000",
                        "parent": "10000100000000",
                        "label": "临床协调",
                        "children": []
                    },
                    {
                        "value": "10000100120000",
                        "parent": "10000100000000",
                        "label": "临床研究",
                        "children": []
                    },
                    {
                        "value": "10000100130000",
                        "parent": "10000100000000",
                        "label": "生物工程/生物制药",
                        "children": []
                    },
                    {
                        "value": "10000100140000",
                        "parent": "10000100000000",
                        "label": "生物信息工程师",
                        "children": []
                    },
                    {
                        "value": "10000100150000",
                        "parent": "10000100000000",
                        "label": "食品/饮料检验",
                        "children": []
                    },
                    {
                        "value": "10000100160000",
                        "parent": "10000100000000",
                        "label": "食品/饮料研发",
                        "children": []
                    },
                    {
                        "value": "10000100170000",
                        "parent": "10000100000000",
                        "label": "试剂研发",
                        "children": []
                    },
                    {
                        "value": "10000100180000",
                        "parent": "10000100000000",
                        "label": "药品研发",
                        "children": []
                    },
                    {
                        "value": "10000100190000",
                        "parent": "10000100000000",
                        "label": "医学信息专员",
                        "children": []
                    },
                    {
                        "value": "10000100200000",
                        "parent": "10000100000000",
                        "label": "医药化学分析",
                        "children": []
                    },
                    {
                        "value": "10000100210000",
                        "parent": "10000100000000",
                        "label": "医药技术研发",
                        "children": []
                    },
                    {
                        "value": "10000100220000",
                        "parent": "10000100000000",
                        "label": "医药信息沟通专员",
                        "children": []
                    },
                    {
                        "value": "10000100230000",
                        "parent": "10000100000000",
                        "label": "医药研发管理",
                        "children": []
                    },
                    {
                        "value": "10000100240000",
                        "parent": "10000100000000",
                        "label": "油漆/化工涂料研发",
                        "children": []
                    },
                    {
                        "value": "10000100250000",
                        "parent": "10000100000000",
                        "label": "造纸研发",
                        "children": []
                    },
                    {
                        "value": "10000100260000",
                        "parent": "10000100000000",
                        "label": "制剂研发",
                        "children": []
                    },
                    {
                        "value": "10000100270000",
                        "parent": "10000100000000",
                        "label": "制药工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "10000200000000",
                "parent": "10000000000000",
                "label": "机电制造类研发",
                "children": [
                    {
                        "value": "10000200010000",
                        "parent": "10000200000000",
                        "label": "车身设计",
                        "children": []
                    },
                    {
                        "value": "10000200020000",
                        "parent": "10000200000000",
                        "label": "船舶设计制造",
                        "children": []
                    },
                    {
                        "value": "10000200030000",
                        "parent": "10000200000000",
                        "label": "电池/电源开发",
                        "children": []
                    },
                    {
                        "value": "10000200040000",
                        "parent": "10000200000000",
                        "label": "电器研发",
                        "children": []
                    },
                    {
                        "value": "10000200050000",
                        "parent": "10000200000000",
                        "label": "发动机/总装工程师",
                        "children": []
                    },
                    {
                        "value": "10000200060000",
                        "parent": "10000200000000",
                        "label": "飞机设计制造",
                        "children": []
                    },
                    {
                        "value": "10000200070000",
                        "parent": "10000200000000",
                        "label": "机械设计",
                        "children": []
                    },
                    {
                        "value": "10000200080000",
                        "parent": "10000200000000",
                        "label": "机械研发工程师",
                        "children": []
                    },
                    {
                        "value": "10000200090000",
                        "parent": "10000200000000",
                        "label": "技术研发工程师",
                        "children": []
                    },
                    {
                        "value": "10000200100000",
                        "parent": "10000200000000",
                        "label": "家电/数码产品研发",
                        "children": []
                    },
                    {
                        "value": "10000200110000",
                        "parent": "10000200000000",
                        "label": "空调工程/设计",
                        "children": []
                    },
                    {
                        "value": "10000200120000",
                        "parent": "10000200000000",
                        "label": "列车设计制造",
                        "children": []
                    },
                    {
                        "value": "10000200130000",
                        "parent": "10000200000000",
                        "label": "模具设计",
                        "children": []
                    },
                    {
                        "value": "10000200140000",
                        "parent": "10000200000000",
                        "label": "汽车零部件设计",
                        "children": []
                    },
                    {
                        "value": "10000200150000",
                        "parent": "10000200000000",
                        "label": "医疗器械研发",
                        "children": []
                    },
                    {
                        "value": "10000200160000",
                        "parent": "10000200000000",
                        "label": "自动化设计工程师",
                        "children": []
                    }
                ]
            },
            {
                "value": "10000300000000",
                "parent": "10000000000000",
                "label": "科研管理",
                "children": [
                    {
                        "value": "10000300010000",
                        "parent": "10000300000000",
                        "label": "技术研发经理/主管",
                        "children": []
                    },
                    {
                        "value": "10000300020000",
                        "parent": "10000300000000",
                        "label": "科研管理人员",
                        "children": []
                    },
                    {
                        "value": "10000300030000",
                        "parent": "10000300000000",
                        "label": "实验室负责人/工程师",
                        "children": []
                    }
                ]
            }
        ]
    },
    {
        "value": "18000000000000",
        "parent": '',
        "label": "医疗/医美/医务",
        "children": [
            {
                "value": "18000100000000",
                "parent": "18000000000000",
                "label": "护士/医助",
                "children": [
                    {
                        "value": "18000100010000",
                        "parent": "18000100000000",
                        "label": "导医",
                        "children": []
                    },
                    {
                        "value": "18000100020000",
                        "parent": "18000100000000",
                        "label": "分诊",
                        "children": []
                    },
                    {
                        "value": "18000100030000",
                        "parent": "18000100000000",
                        "label": "护工",
                        "children": []
                    },
                    {
                        "value": "18000100040000",
                        "parent": "18000100000000",
                        "label": "护理主任",
                        "children": []
                    },
                    {
                        "value": "18000100050000",
                        "parent": "18000100000000",
                        "label": "护士",
                        "children": []
                    },
                    {
                        "value": "18000100060000",
                        "parent": "18000100000000",
                        "label": "护士长",
                        "children": []
                    }
                ]
            },
            {
                "value": "18000200000000",
                "parent": "18000000000000",
                "label": "医生/药剂师",
                "children": [
                    {
                        "value": "18000200010000",
                        "parent": "18000200000000",
                        "label": "B超医生",
                        "children": []
                    },
                    {
                        "value": "18000200020000",
                        "parent": "18000200000000",
                        "label": "ICU医生",
                        "children": []
                    },
                    {
                        "value": "18000200030000",
                        "parent": "18000200000000",
                        "label": "病理医师",
                        "children": []
                    },
                    {
                        "value": "18000200040000",
                        "parent": "18000200000000",
                        "label": "儿科医生",
                        "children": []
                    },
                    {
                        "value": "18000200050000",
                        "parent": "18000200000000",
                        "label": "放射科医师",
                        "children": []
                    },
                    {
                        "value": "18000200060000",
                        "parent": "18000200000000",
                        "label": "辅诊医生",
                        "children": []
                    },
                    {
                        "value": "18000200070000",
                        "parent": "18000200000000",
                        "label": "核磁共振医生",
                        "children": []
                    },
                    {
                        "value": "18000200080000",
                        "parent": "18000200000000",
                        "label": "急诊医生",
                        "children": []
                    },
                    {
                        "value": "18000200090000",
                        "parent": "18000200000000",
                        "label": "检验科医师",
                        "children": []
                    },
                    {
                        "value": "18000200100000",
                        "parent": "18000200000000",
                        "label": "接诊医生",
                        "children": []
                    },
                    {
                        "value": "18000200110000",
                        "parent": "18000200000000",
                        "label": "临床医生",
                        "children": []
                    },
                    {
                        "value": "18000200120000",
                        "parent": "18000200000000",
                        "label": "麻醉医生",
                        "children": []
                    },
                    {
                        "value": "18000200130000",
                        "parent": "18000200000000",
                        "label": "美容整形科医生",
                        "children": []
                    },
                    {
                        "value": "18000200140000",
                        "parent": "18000200000000",
                        "label": "内科医生",
                        "children": []
                    },
                    {
                        "value": "18000200150000",
                        "parent": "18000200000000",
                        "label": "全科医生",
                        "children": []
                    },
                    {
                        "value": "18000200160000",
                        "parent": "18000200000000",
                        "label": "兽医",
                        "children": []
                    },
                    {
                        "value": "18000200170000",
                        "parent": "18000200000000",
                        "label": "外科医生",
                        "children": []
                    },
                    {
                        "value": "18000200180000",
                        "parent": "18000200000000",
                        "label": "心电图医生",
                        "children": []
                    },
                    {
                        "value": "18000200190000",
                        "parent": "18000200000000",
                        "label": "心理医生",
                        "children": []
                    },
                    {
                        "value": "18000200200000",
                        "parent": "18000200000000",
                        "label": "牙科医生",
                        "children": []
                    },
                    {
                        "value": "18000200210000",
                        "parent": "18000200000000",
                        "label": "眼科医生",
                        "children": []
                    },
                    {
                        "value": "18000200220000",
                        "parent": "18000200000000",
                        "label": "验光师",
                        "children": []
                    },
                    {
                        "value": "18000200230000",
                        "parent": "18000200000000",
                        "label": "药剂师",
                        "children": []
                    },
                    {
                        "value": "18000200240000",
                        "parent": "18000200000000",
                        "label": "医学影像/放射科医师",
                        "children": []
                    },
                    {
                        "value": "18000200250000",
                        "parent": "18000200000000",
                        "label": "营养师",
                        "children": []
                    },
                    {
                        "value": "18000200260000",
                        "parent": "18000200000000",
                        "label": "针灸/推拿",
                        "children": []
                    },
                    {
                        "value": "18000200270000",
                        "parent": "18000200000000",
                        "label": "中药师",
                        "children": []
                    },
                    {
                        "value": "18000200280000",
                        "parent": "18000200000000",
                        "label": "中医科医生",
                        "children": []
                    },
                    {
                        "value": "18000200290000",
                        "parent": "18000200000000",
                        "label": "专科医生",
                        "children": []
                    }
                ]
            },
            {
                "value": "18000300000000",
                "parent": "18000000000000",
                "label": "医务管理",
                "children": [
                    {
                        "value": "18000300010000",
                        "parent": "18000300000000",
                        "label": "医疗管理",
                        "children": []
                    },
                    {
                        "value": "18000300020000",
                        "parent": "18000300000000",
                        "label": "医务干事",
                        "children": []
                    },
                    {
                        "value": "18000300030000",
                        "parent": "18000300000000",
                        "label": "医务管理",
                        "children": []
                    },
                    {
                        "value": "18000300040000",
                        "parent": "18000300000000",
                        "label": "医院院长/副院长",
                        "children": []
                    }
                ]
            }
        ]
    }
]

data = []

for first_job in job:
    for sec_job in first_job['children']:
        for third_job in sec_job['children']:
            item = {}
            item['一级分类'] = first_job['label']
            item['一级ID'] = first_job['value']
            item['二级分类'] = sec_job['label']
            item['二级ID'] = sec_job['value']
            item['三级分类'] = third_job['label']
            item['三级ID'] = third_job['value']
            print(item)
            data.append(item)
import pandas as pd
df = pd.DataFrame(data=data)
df.to_excel('行业映射表.xlsx', index=False)

